// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    int chest = 42;                         // Десятичный целочисленный литерал числа 42;
    int waist = 0x42;                       // Шестнадцатеричный целочисленный литерал числа 42 (в десятичной системе = 66);
    int inseam = 042;                       // Восьмеричный целочисленный литерал числа 42 (в десятичной системе = 34);
    cout << "Параметры человека для подбора одежды:\n";
    cout << "Грудь = " << chest << " (42 в десятичной системе счисления).\n";
    cout << "Талия = " << waist << " (0x42 в шестнадцатеричной системе счисления).\n";
    cout << "Длина внутреннего шва брюк = " << inseam << " (042 в восьмеричной системе счисления).\n";
    return 0;
}
*/

// Стандарт С++20:

#include <iostream>
#include <cstdint>               // Подключение типов данных с гарантированным фиксированным размером в битах;

int main()
{
    std::int32_t chest{42};      // Безопасная списковая инициализация переменной chest десятичным литералом числа 42;
    std::int32_t waist{0x42};    // Безопасная списковая инициализация переменной waist шестнадцатеричным литералом числа 66 (0x42);
    std::int32_t inseam{042};    // Безопасная списковая инициализация переменной inseam восьмеричным литералом числа 34 (042);
    std::cout << "Параметры человека для подбора одежды:\n";
    std::cout << "Грудь = " << chest << " (42 в десятичной системе счисления).\n";
    std::cout << "Талия = " << waist << " (0x42 в шестнадцатеричной системе счисления).\n";
    std::cout << "Длина внутреннего шва брюк = " << inseam << " (042 в восьмеричной системе счисления).\n";
}


// Стандарт С++23/С++26:
/*
//import std;
#include <print>
#include <cstdint>               // Подключение типов данных с гарантированным фиксированным размером в битах;

int main()
{
    std::int32_t chest{42};      // Безопасная списковая инициализация переменной chest десятичным литералом числа 42;
    std::int32_t waist{0x42};    // Безопасная списковая инициализация переменной waist шестнадцатеричным литералом числа 66 (0x42);
    std::int32_t inseam{042};    // Безопасная списковая инициализация переменной inseam восьмеричным литералом числа 34 (042);

    std::println("Параметры человека для подбора одежды:");
    std::println("Грудь = {} (42 в десятичной системе счисления)", chest);
    std::println("Талия = {} (0x42 в шестнадцатеричной системе счисления).", waist);
    std::println("Длина внутреннего шва брюк = {} (042 в восьмеричной системе счисления).", inseam);
}
*/

