// Стандарт С++20:
#include <iostream>                         // Директива препроцессора для работы со стандартным потоком ввода-вывода;

int main()                                  // Главная функция программы;
{
    std::cout << "Васильев Василий Васильевич\n";
    std::cout << "г. Васильевск, ул. Васи д.77 кв.7\n"; // \n осуществляет быстрый перевод курсора на новую строку;
}


// Стандарт С++23/С++26 (Теория будущего):
/*
import std;                                 // Ультимативный импорт всей стандартной библиотеки C++23;

int main()
{
    std::println("Васильев Василий Васильевич");
    std::println("г. Васильевск, ул. Васи д.77 кв.7"); // Функция println сама автоматически переносит строку;
}
*/
