// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    int auks, bats, coots;
    auks = 19.99 + 11.99;                   // При сложении двух дробных значений, у результата дробная часть отсечется;
    bats = (int)19.99 + (int)11.99;         // Сначала произойдет приведение к типу int, дробная часть значений отсечется, затем произойдет сложение значений;
    coots = int(19.99) + int(11.99);        // Сначала произойдет приведение к типу int, дробная часть значений отсечется, затем произойдет сложение значений;
    cout << "Гагарки = " << auks << ", летучие мыши = " << bats;
    cout << ", лысухи = " << coots << endl;
    char ch = 'Z';
    cout << "Код символа " << ch << " = ";
    cout << int(ch) << endl;                // Для отображения кода символа Z, применено приведение к типу int;
    cout << "Да, код = ";
    cout << static_cast<int>(ch) << endl;   // При использовании именованного оператора явного приведения типа, переменная типа char получает тип int. Получим код символа Z;
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>
#include <format>
#include <cstdint>                                                                              // Подключение типов данных с гарантированным фиксированным размером в битах;

int main()
{
    int auks{0}, bats{0}, coots{0};
    auks = static_cast<std::int32_t>(19.99 + 11.99);                                            // При сложении двух дробных значений, у результата дробная часть отсечется;
    bats = static_cast<std::int32_t>(19.99) + static_cast<std::int32_t>(11.99);                 // Сначала произойдет приведение к типу std::int32_t, дробная часть значений отсечется, затем произойдет сложение значений;
    coots = static_cast<std::int32_t>(19.99) + static_cast<std::int32_t>(11.99);                // Сначала произойдет приведение к типу std::int32_t, дробная часть значений отсечется, затем произойдет сложение значений;
    std::cout << std::format("Гагарки = {}, летучие мыши = {}, лысухи = {}\n", auks, bats, coots);
    char ch{'Z'};
    std::cout << std::format("Код символа {} = {}\n", ch, static_cast<std::int32_t>(ch));   // Для отображения кода символа Z, применено приведение к типу std::int32_t;
    std::cout << std::format("Да, код = {}\n", static_cast<std::int32_t>(ch));                  // При использовании именованного оператора явного приведения типа, переменная типа char получает тип std::int32_t. Получим код символа Z;
}




// Стандарт С++23/С++26:
/*
//import std;
#include <print>
#include <cstdint>                          // Подключение типов данных с гарантированным фиксированным размером в битах;

int main()
{
    int auks{0}, bats{0}, coots{0};
    auks = static_cast<std::int32_t>(19.99 + 11.99);                                    // При сложении двух дробных значений, у результата дробная часть отсечется;
    bats = static_cast<std::int32_t>(19.99) + static_cast<std::int32_t>(11.99);         // Сначала произойдет приведение к типу std::int32_t, дробная часть значений отсечется, затем произойдет сложение значений;
    coots = static_cast<std::int32_t>(19.99) + static_cast<std::int32_t>(11.99);        // Сначала произойдет приведение к типу std::int32_t, дробная часть значений отсечется, затем произойдет сложение значений;
    std::println("Гагарки = {}, летучие мыши = {}, лысухи = {}", auks, bats, coots);
    char ch{'Z'};
    std::println("Код символа {} = {}", ch, static_cast<std::int32_t>(ch));  // Для отображения кода символа Z, применено приведение к типу std::int32_t;
    std::println("Да, код = {}", static_cast<std::int32_t>(ch));                 // При использовании именованного оператора явного приведения типа, переменная типа char получает тип std::int32_t. Получим код символа Z;
}
*/
