// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    cout << "В каком году построен ваш дом?\n";
    int year;
    (cin >> year).get();                        // Предопределенный объект cin с помощью оператора ввода >> принимает числовое значение и сразу применяет метод .get(), чтобы удалить оставшийся в буфере ввода символ переноса строки \n;
    cout << "Какой адрес вашего дома?\n";
    char address[80];                            // Объявление пустого массива из 80 элементов;
    cin.getline(address, 80);                   // Предопределенный объект cin применяет функцию getline(), которая принимает 1 аргументом массив и 2 аргументом его размер. getline() считывает строку вместе с пробелами до символа \n, который извлекается и автоматически заменяется на нуль-терминатор \0;
    cout << "Дом построен: " << year << endl;   // Вывод сообщения в поток консоли с помощью предопределенного объекта cout и оператора вставки <<;
    cout << "Адрес: " << address << endl;        // Вывод сообщения в поток консоли с помощью предопределенного объекта cout и оператора вставки <<;
    cout << "Готово!\n";
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>
#include <format>
#include <cstdint>

constexpr int32_t ar_size{80};

int main()
{
    std::cout << "В каком году построен ваш дом?\n";
    int32_t year;
    (std::cin >> year).get();                          // Предопределенный объект cin с помощью оператора ввода >> принимает числовое значение, и применяет метод .get(), чтобы удалить оставшийся в буфере ввода символ переноса строки \n;
    std::cout << "Какой адрес вашего дома?\n";
    char address[ar_size];                             // Объявление пустого массива из 80 элементов;
    std::cin.getline(address, ar_size);               // Предопределенный объект cin применяет функцию getline(), которая принимает 1 аргументом массив и 2 аргументом его размер. getline() считывает строку вместе с пробелами до символа \n, который извлекается и автоматически заменяется на нуль-терминатор \0;
    std::cout << std::format("Дом построен: {}\n", year);   // Оператор << передает в cout строку, которую сгенерировала функция std::format;
    std::cout << std::format("Адрес: {}\n", address);       // Оператор << передает в cout строку, которую сгенерировала функция std::format;
    std::cout << "Готово!\n";
}



// Стандарт С++23/С++26:
/*
#include <iostream>
#include <print>
#include <string>
#include <cstdint>

int main()
{
    std::println("В каком году построен ваш дом?");
    int32_t year;
    std::cin >> year;                                    // Предопределенный объект cin с помощью оператора ввода >> принимает числовое значение;
    std::cin.ignore();                                   // Предопределенный объект cin применяет метод .ignore(), который удаляет символ \n, который остался в буфере ввода;
    std::println("Какой адрес вашего дома?");
    std::string address;                                 // Объявление пустого динамического строкового объекта;
    std::getline(std::cin, address);               // Функция getline считывает строку до символа новой строки \n, который потом отбрасывается, вместе с пробелами в строковый объект, при этом размер объекта становится равным под размер ввода;
    std::println("Дом построен: {}", year);   // Функция println берет переменную типа int32_t и безопасно форматирует её значение в UTF-8 напрямую в консоль, автоматически добавляя перенос строки;
    std::println("Адрес: {}", address);       // Функция println берет строковый динамический объект и безопасно форматирует текст в UTF-8 в консоль;
    std::println("Готово!");
}
*/