// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    cout.setf(ios_base::fixed, ios_base::floatfield);    // Включает режим вывода чисел с плавающей точкой в фиксированном формате, вывод через экспоненту запрещен;
    float tree = 3;                                                // При присвоении целочисленного значения переменной типа float, запишется значение с плавающей точкой;
    int guess = 3.9832;                                            // При присвоении значения с плавающей точкой переменной типа int, дробная часть отсечется;
    int debt = 7.2E12;                                             // При присвоении значения с плавающей точкой переменной типа int. Также произойдет переполнение типа, т.к. значение превышает максимальный порог;
    cout << "tree = " << tree << endl;
    cout << "guess = " << guess << endl;
    cout << "debt = " << debt << endl;
    return 0;
}
*/

/*
cout.setf(ios_base::fixed, ios_base::floatfield); — Функция cout.setf включает режим вывода чисел с плавающей точкой в фиксированном формате, вывод через экспоненту запрещен.
ios_base::fixed — включение флага вывода значения только в дробном формате, после точки выведутся значения не в экспоненциальной форме.
ios_base::floatfield — сброс всех предыдущих флагов форматирования и установка последнего флага.
*/


// Стандарт С++20:

#include <iostream>
#include <format>
#include <cstdint>                                           // Подключение типов данных с гарантированным фиксированным размером в битах;

int main()
{
    float tree{3.0f};                                        // При присвоении целочисленного значения переменной типа float, запишется значение с плавающей точкой;
    std::int32_t guess{static_cast<std::int32_t>(3.9832)};   // При присвоении значения с плавающей точкой переменной типа int, дробная часть отсечется;
    std::int32_t debt{static_cast<std::int32_t>(7.2E12)};    // При присвоении значения с плавающей точкой переменной типа int. Также произойдет переполнение типа, т.к. значение превышает максимальный порог;
    std::cout << std::format("tree = {:f}\n", tree);
    std::cout << std::format("guess = {}\n", guess);
    std::cout << std::format("debt = {}\n", debt);
}

/*
std::int32_t debt{static_cast<std::int32_t>(7.2E12)}; - безопасная инициализация переменной с явным приведением типа применяется к вещественному литералу 7.2E12.
Дробная часть отсечется. В данном случае переменной присвоится совсем большое значение, т.к. компилятор форму 7.2E12 преобразует в 720000000000,
которое не помещается в границы типа int, произойдет переполнение. В данной операции компилятору не придется отсекать дробную часть. Итоговый результат равен -2147483648;
*/


// Стандарт С++23/С++26:
/*
//import std;
#include <iostream>
#include <print>
#include <cstdint>               // Подключение типов данных с гарантированным фиксированным размером в битах;

int main()
{
    float tree{3.0f};                                        // При присвоении целочисленного значения переменной типа float, запишется значение с плавающей точкой;
    std::int32_t guess{static_cast<std::int32_t>(3.9832)};   // При присвоении значения с плавающей точкой переменной типа int, дробная часть отсечется;
    std::int32_t debt{static_cast<std::int32_t>(7.2E12)};    // При присвоении значения с плавающей точкой переменной типа int. Также произойдет переполнение типа, т.к. значение превышает максимальный порог;
    std::println("tree = {:f}", tree);
    std::println("guess = {}", guess);
    std::println("debt = {}", debt);
}
*/