// Стандарт С++20:

#include <iostream>                                          // Директива препроцессора. Подключение заголовочного файла ввода-вывода;

static double Celsius_To_Fahrenheit(double);                 // Прототип функции перевода Цельсия в Фаренгейты, принимающей и возвращающей вещественное число double. Квалификатор static делает её видимой только в этом файле;

int main()                                                   // Определение главной функции, координирующей работу программы;
{
    double cels;                                             // Объявление вещественной переменной double для хранения температуры по Цельсию;
    std::cout << "Введите температуру в Цельсиях: ";         // Префикс std:: указывает на стандартную библиотеку. Оператор вставки << отправляет строку в поток вывода консоли;
    std::cin >> cels;                                        // Префикс std:: указывает на стандартную библиотеку. Оператор извлечения >> забирает значение из консоли и записывает в переменную cels;
    double faren =  Celsius_To_Fahrenheit(cels);             // Объявление вещественной переменной faren и её одновременная инициализация результатом работы пользовательской функции;
    std::cout << cels << " градуса Цельсия = " << faren
              << " градусам по Фаренгейту.\n";               // Сцепление (каскадирование) операторов << для последовательного вывода нескольких элементов в поток за один раз;
}

static double Celsius_To_Fahrenheit(double celsius)          // Определение чистой функции преобразования температуры;
{
    return 1.8 * celsius + 32.0;                             // Функция с помощью оператора return рассчитывает формулу и возвращает полученное вещественное значение;
}

// Стандарт С++23/С++26:
/*
//import std;                                                // Заменяет все старые #include. import std включает в себя сразу все функции ввода-вывода и современной печати (пока экспериментально);
#include <iostream>                                          // Подключение классического заголовочного файла ввода-вывода (для работы std::cin);
#include <print>                                             // Подключение заголовочного файла современной форматированной печати (для работы функций std::print/println);

static double Celsius_To_Fahrenheit(double);                 // Прототип функции. Квалификатор static оставляет её видимой только в текущем файле;

int main()                                                   // Определение главной функции;
{
    double cels;                                             // Объявление вещественной переменной;
    std::print("Введите температуру в Цельсиях: ");          // Функция print выводит форматированный текст в поток консоли без автоматического перевода строки;
    std::cin >> cels;                                        // Ввод числового значения из консоли и запись в переменную cels;
    double faren =  Celsius_To_Fahrenheit(cels);             // Вызов функции Celsius_To_Fahrenheit и инициализация переменной faren полученным значением;
    std::println("{} градуса Цельсия = {} градусам по Фаренгейту.",
                 cels, faren);                               // Функция println выводит форматированный текст будущего и сама автоматически переводит строку в конце. Переменные переданы для подстановки в {};
}

static double Celsius_To_Fahrenheit(double celsius)          // Определение функции бизнес-логики;
{
    return 1.8 * celsius + 32.0;                             // Возврат вычисленного вещественного значения по формуле С. Праты;
}
*/
