// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    const int ArSize = 20;
    char name[ArSize];                              // Объявление пустого массива из 20 элементов;
    char dessert[ArSize];                           // Объявление пустого массива из 20 элементов;
    cout << "Введите свое имя:\n";
    cin.getline(name, ArSize);                      // Предопределнный объет cin применяет функцию getline, которая принимает 1 аргументом массив, куда запишется строка и 2 аргументом размер этого массива. getline принимает строку до символа \n, который заменяется на \0;
    cout << "Введите свой любимый десерт:\n";
    cin.getline(dessert, ArSize);                   // Предопределнный объет cin применяет функцию getline, которая принимает 1 аргументом массив, куда запишется строка и 2 аргументом размер этого массива. getline принимает строку до символа \n, который заменяется на \0;
    cout << "У меня есть вкусный " << dessert;      // Оператор << считывает символы из массива dessert до первого '\0' и передает их в поток cout;
    cout << " для тебя, " << name << ".\n";         // Оператор << считывает символы из массива name до первого '\0' и передает их в поток cout;
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>
#include <format>
#include <cstdint>

constexpr int32_t ar_size{20};

int main()
{
    char name[ar_size];                    // Объявление пустого массива из 20 элементов;
    char dessert[ar_size];                 // Объявление пустого массива из 20 элементов;
    std::cout << "Введите свое имя:\n";
    std::cin.getline(name, ar_size);     // Предопределнный объет cin применяет функцию getline, которая принимает 1 аргументом массив, куда запишется строка и 2 аргументом размер этого массива. getline принимает строку до символа \n, который заменяется на \0;
    std::cout << "Введите свой любимый десерт:\n";
    std::cin.getline(dessert, ar_size);  // Предопределнный объет cin применяет функцию getline, которая принимает 1 аргументом массив, куда запишется строка и 2 аргументом размер этого массива. getline принимает строку до символа \n, который заменяется на \0;
    std::cout << std::format("У меня есть вкусный {}", dessert);// Оператор << передает в cout строку, которую сгенерировала функция std::format;
    std::cout << std::format(" для тебя, {}.\n", name);         // Оператор << передает в cout строку, которую сгенерировала функция std::format;
}

/*
  Данный код стандарта С++11/20 не гарантирует 100% работу на другой операционной системе.
Если ввести строки на кириллице или другом языке отличном от английского, через вывод оператора <<,
который передает в объект cout, на консоле могут быть разные непонятные символы.
По причине, что каждая операционная система кодирует байты по своему стандарту, в отличии от стандарта,
на котором создавалась программа.
*/


// Стандарт С++23/С++26
/*
#include <print>
#include <iostream>
#include <string>

int main()
{
    std::string name;                      // Объявление пустого динамического строкового объекта;
    std::string dessert;                   // Объявление пустого динамического строкового объекта;
    std::println("Введите свое имя:"); // Функция println автоматически выводит UTF-8 строку в поток вывода и автоматически переносит курсор на следующую строку;
    std::getline(std::cin,name);     // Функция getline считывает строку до символа новой строки \n, который потом отбрасывается, вместе с пробелами в строковый объект, при этом размер объекта становится равным под размер ввода;
    std::println("Введите свой любимый десерт:");     // Функция println автоматически выводит UTF-8 строку в поток вывода и автоматически переносит курсор на следующую строку;
    std::getline(std::cin,dessert);  // Функция getline считывает строку до символа новой строки \n, который потом отбрасывается, вместе с пробелами в строковый объект, при этом размер объекта становится равным под размер ввода;
    std::print("У меня есть вкусный {}", dessert);// Функция print берет строковый динамический объект и безопасно форматирует текст в UTF-8 в консоль;
    std::println(" для тебя, {}.", name);         // Функция print берет строковый динамический объект и безопасно форматирует текст в UTF-8 в консоль;
}
*/

/*
 В программе вместо массива, в котором жестко зафиксирован размер,
применен динамический строковый объект, который гарантирует, отсутствие переполнения памяти
и захвата памяти под другие данные. При этом код становится переносимым в другие ОС.
*/