// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    int yams[3];                                                    // Объявление массива из 3 элементов типа int;
    yams[0] = 7;                                                    // Присваивание 1 элементу под индексом 0 значение 7;
    yams[1] = 8;                                                    // Присваивание 2 элементу под индексом 1 значение 8;
    yams[2] = 6;                                                    // Присваивание 3 элементу под индексом 2 значение 6;
    int yamcosts[3] = {20, 30, 5};                                  // Инициализация массива из 3 элементов типа int;
    cout << "Всего батата = ";
    cout << yams[0] + yams[1] + yams[2] << endl;                    // Оператор << передает в объект вывода cout результат сложения 3 элементов массива;
    cout << "В упаковке " << yams[1] << " штук батата; стоимость "; // Оператор << передает в поток cout значение элемента массива под индексом 1;
    cout << yamcosts[1] << " центов за батат.\n";                   // Оператор << передает в поток cout значение элемента массива yamcosts под индексом 1;
    int total = yams[0] * yamcosts[0] + yams[1] * yamcosts[1];      // Инициализация переменной total значением, вычисленным из элементов массивов;
    total = total + yams[2] * yamcosts[2];                          // Увеличение значения переменной total на произведение оставшихся элементов массивов;
    cout << "Общие затраты на батат = " << total << " центов";
    cout << "\nРазмер массива yams = " << sizeof yams;              // Применяя оператор sizeof, определяем размер массива;
    cout << " байт.\n";
    cout << "Размер одного элемента массива yams = " << sizeof yams[0]; // Применяя оператор sizeof, определяем размер одного элемента массива;
    cout << " байт.\n";
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>
#include <format>
#include <cstdint>
#include <array>

inline constexpr std::array<int32_t, 3>yamcosts{20, 30, 5};               // Безопасная инициализация константы-массива, при помощи определнного объекта array, который задает точные парамтеры массива. Значения защищены от изменений. inline - квалификатор защищает от дублирования контанты во всем проекте;

int main ()
{
    std::array<int32_t, 3>yams{7, 8, 6};                                  // Безопасная инициализация массива, при помощи определнного объекта array, который задает точные парамтеры массива;
    std::cout << "Всего батата = ";
    std::cout << std::format("{}\n", yams[0] + yams[1] + yams[2]); // Оператор <<  передает в cout готовую текстовую строку (std::string), которую сгенерировала функция std::format;
    std::cout << std::format("В упаковке {} штук батата; стоимость ", yams[1]); // Оператор <<  передает в cout готовую текстовую строку (std::string), которую сгенерировала функция std::format;
    std::cout << std::format("{} центов за батат.\n", yamcosts[1]);// Оператор <<  передает в cout готовую текстовую строку (std::string), которую сгенерировала функция std::format;
    const int32_t total = (yams[0] * yamcosts[0]) +                       // При безопасной инициализации переменной, присваивается результат математического выражения. Этот результат защащается квалификатором const;
                          (yams[1] * yamcosts[1]) +
                          (yams[2] * yamcosts[2]);
    std::cout << std::format("Общие затраты на батат = {} центов", total);       // Оператор <<  передает в cout готовую текстовую строку (std::string), которую сгенерировала функция std::format;
    std::cout << std::format("\nРазмер массива yams = {} байт.\n", sizeof yams); // Применяя оператор sizeof, определяем размер массива;
    std::cout << std::format("Размер одного элемента массива yams = {} байт.\n", sizeof yams[0]); // Применяя оператор sizeof, определяем размер одного элемента массива типа int32_t в байтах;
}


// Стандарт С++23/С++26:
/*
#include <print>
#include <cstdint>
#include <array>                                                          // Подключение заголовочного файла, для применения определнного объекта array;
#include <numeric>                                                        // Подключение библиотеки для подсчета суммы;

inline constexpr std::array<int32_t, 3>yamcosts{20, 30, 5};               // Безопасная инициализация константы-массива, при помощи определнного объекта array, который задает точные парамтеры массива. Значения защищены от изменений. inline - квалификатор защищает от дублирования контанты во всем проекте;

int main ()
{
    std::array<int32_t, 3>yams{7, 8, 6};                                  // Безопасная инициализация массива, при помощи определнного объекта array, который задает точные парамтеры массива;
    std::print("Всего батата = ");
    std::println("{}", std::accumulate(yams.begin(), yams.end(), int32_t{0}));  // В функции println производится подсчет суммы элементов и прямой вывод отформатированного значения в поток вывода;
    std::print("В упаковке {} штук батата; стоимость ", yams[1]);         // Функция print форматирует значение индекса 1 и выводит его напрямую в поток вывода без создания временного объекта строки;
    std::println("{} центов за батат.", yamcosts[1]);                     // Функция println форматирует значение константы и выводит его напрямую в поток вывода, автоматически добавляя перенос строки;
    const int32_t total = (yams[0] * yamcosts[0]) +                       // При безопасной инициализации переменной, присваивается результат математического выражения. Этот результат защащается квалификатором const;
                          (yams[1] * yamcosts[1]) +
                          (yams[2] * yamcosts[2]);
    std::println("Общие затраты на батат = {} центов", total);            // Функция println выполняет прямое форматирование и вывод переменной total с последующим переносом строки;
    std::println("Размер массива yams = {} байт.", sizeof yams);                      // Для определения размера статического массива в байтах применяется оператор sizeof;
    std::println("Размер одного элемента массива yams = {} байт.\n", sizeof yams[0] ); // Для определения размера одного элемента массива типа int32_t в байтах применяется оператор sizeof;
}

*/