// Стандарт С++11:
/*
#include <iostream>                         // Директива препроцессора. Подключение заголовочного файла ввода-вывода;

static void simon(int n);                   // Прототип функции, которая принимает целочисленное знаковое значение и ничего не возвращает;
                                            // Квалификатор static делает функцию видимой только для этого файла;
int main()                                  // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    using namespace std;                    // Открывает все имена из пространства std целиком, убирая необходимость писать префиксы;
    simon(3);                               // Вызов функции, которая принимает целочисленное значение;
    cout << "Введите целое число: ";        // Вывод сообщения в поток консоли с помощью предопределенного объекта cout и оператора вставки <<;
    int count;                              // Объявление переменной;
    cin >> count;                           // Ввод сообщения (значения) из потока консоли предопределенного объекта cin и оператора извлечения >> (извлечения в переменную);
    simon(count);                           // Вызов функции, которая принимает введенное значение, которое приняла переменная count;
    cout << "Готово!" << endl;              // Сцепление (каскадирование) операторов << для вывода нескольких элементов в поток за один раз;
    return 0;                               // Функция возвращает 0, функция (программа) выполнена успешно;
}

static void simon(int n)                    // Определение функции:
{
    using namespace std;                    // Открывает все имена из пространства std целиком, убирая необходимость писать префиксы;
    cout << "Саймон говорит: дотронься до своих пальцев" << n << " раз." << endl; // Сцепление (каскадирование) операторов << для вывода нескольких элементов в поток за один раз;
*/


// Стандарт С++20:

#include <iostream>                          // Директива препроцессора. Подключение заголовочного файла ввода-вывода;

static void simon(int);                      // Прототип функции, которая принимает целочисленное знаковое значение и ничего не возвращает;

int main()                                   // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    simon(3);                              // Вызов функции, которая принимает целочисленное значение;
    std::cout << "Введите целое число: ";    // Префикс std:: указывает компилятору, что предопределенный объект cout берется из стандартной библиотеки и оператор потока вывода (вставки) <<;
    int count;                               // Объявление переменной;
    std::cin >> count;                       // Префикс std:: указывает компилятору, что предопределенный объект cin берется из стандартной библиотеки и оператор потока ввода (извлечения) >>, при вводе значения, извлекается из консоли значение и присваивается переменной;
    simon(count);                            // Вызов функции, которая принимает введенное значение, которое приняла переменная count;
    std::cout << "Готово!\n";                // Префикс std:: указывает компилятору, что предопределенный объект cout берется из стандартной библиотеки и оператор потока вывода (вставки) <<;
}

static void simon(int n)
{
    std::cout << "Саймон говорит: дотронься до своих пальцев" << n << " раз.\n"; // Сцепление (каскадирование) операторов << для вывода нескольких элементов в поток за один раз;
}


// Стандарт С++23/С++26:
/*
import std;                                                  // Заменяет #include <iostream>. import std включает в себя все функции ввода-вывода и современной печати;

static void simon(int);                                      // Прототип функции, которая принимает целочисленное знаковое значение и ничего не возвращает. Квалификатор static делает функцию видимой только для этого файла;

int main()                                                   // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    simon(3);                                                // Вызов функции, которая принимает целочисленное значение;
    std::print("Введите целое число: ");                     // Функция print выводит текст БЕЗ перевода на новую строку;
    int count;                                               // Объявление переменной;
    std::cin >> count;                                       // Префикс std:: указывает компилятору, что предопределенный объект cin берется из стандартной библиотеки и оператор потока ввода (извлечения) >>;
    simon(count);                                            // Вызов функции, которая принимает введенное значение, которое приняла переменная count;
    std::println("Готово!");                                 // Функция println сама автоматически переводит строку в конце, знак \n больше не нужен;
}

static void simon(int n)                                     // Определение функции;
{
    // Новинка C++23: переменная n автоматически подставляется в строку на место фигурных скобок {} через запятую;
    std::println("Саймон говорит: дотронься до своих пальцев {} раз.", n);
}
*/

