// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    int donuts = 6;
    double cups = 4.5;
    cout << "Количество пончиков = " << donuts;                     // Объект cout c помощью оператора << выводит строковый литерал со значением переменной;
    cout << " и адрес значения пончиков = " << &donuts << endl;     // Объект cout c помощью оператора << выводит строковый литерал с адресом значения переменной;
    cout << "Количесвто чашек = " << cups;                          // Объект cout c помощью оператора << выводит строковый литерал со значением переменной;
    cout << " и адрес значения чашек = " << &cups << endl;          // Объект cout c помощью оператора << выводит строковый литерал с адресом значения переменной;
}
*/

/*
  Локальные переменные donuts и cups создаются в области памяти, называемой стек (stack).
Размер donuts (int) обычно составляет 4 байта, а cups (double) — 8 байт. Расстояние между
их адресами в памяти зависит от компилятора, архитектуры процессора и выравнивания данных.
Порядок их размещения не гарантирован стандартом C++: они могут лежать как вплотную,
так и на удалении друг от друга.
*/


// Стандарт С++20:

#include <iostream>
#include <format>
#include <cstdint>

int main()
{
    int32_t donuts = 6;
    double cups = 4.5;
    std::cout << std::format("Количество пончиков = {}"                          // Объект cout c помощью оператора << выводит отформатированный строковый литерал со значением переменной и адресом значения переменной;
    "и адрес значения пончиков = {}\n", donuts, static_cast<const void*>(&donuts)); // static_cast<const void*>(&donuts)) - безопасное приведение адреса &donuts к универсальному указателю типа void;
    std::cout << std::format("Количесвто чашек = {}"                             // Объект cout c помощью оператора << выводит отформатированный строковый литерал со значением переменной и адресом значения переменной;
    " и адрес значения чашек = {}\n", cups, static_cast<const void*>(&cups));       // static_cast<const void*>(&cups)) - безопасное приведение адреса &cups к универсальному указателю типа void;
}


/*
  static_cast<const void*>(&donuts) необходим для std::format, чтобы временно
привести указатель к типу "сырого" адреса памяти (void*). Это сообщает функции
format, что тип int32_t* интерпретировать не нужно, а следует просто безопасно
вывести номер ячейки памяти в шестнадцатеричном формате.
*/


// Стандарт С++23/С++26
/*
#include <print>
#include <cstdint>

int main()
{
    int32_t donuts = 6;
    double cups = 4.5;
    std::println("Количество пончиков = {}"                                      // Функция println выводит отформатированный строковый литерал со значением переменной и адресом значения переменной;
    "и адрес значения пончиков = {}\n", donuts, static_cast<const void*>(&donuts)); // static_cast<const void*>(&donuts)) - безопасное приведение адреса &donuts к универсальному указателю типа void;
    std::println("Количесвто чашек = {}"                                         // Функция println выводит отформатированный строковый литерал со значением переменной и адресом значения переменной;
    " и адрес значения чашек = {}\n", cups, static_cast<const void*>(&cups));       // static_cast<const void*>(&cups)) - безопасное приведение адреса &cups к универсальному указателю типа void;
}
*/