// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    int chest = 42;                     // Объявление знаковой целочисленной переменной типа int c последующей инициализацией;
    int waist = 42;                     // Объявление знаковой целочисленной переменной типа int c последующей инициализацией;
    int inseam = 42;                    // Объявление знаковой целочисленной переменной типа int c последующей инициализацией;
    cout << "Параметры человека для подбора одежды:" << endl;
    cout << "Грудь = " << chest << " (42 в десятичной системе счисления)." << endl;     // Изначально объект cout имеет десятичную форму (dec);
    cout << hex;                                                                        // Для отображения значения 42 в шестнадцатеричной форме, к объекту cout применятся манипулятор hex;
    cout << "Талия = " << waist << " (42 в шестнадцатеричной системе счисления 2А)." << endl;
    cout << oct;                                                                        // Для отображения значения 42 в восьмеричной форме, к объекту cout применятся манипулятор oct;
    cout << "Длина внутреннего шва брюк = " << inseam << " (42 в восьмеричной системе исчисления 52)." << endl;
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>
#include <cstdint>                                                                 // Подключение типов данных с гарантированным фиксированным размером в битах;

int main()
{
    std::int32_t chest{42};                                                        // Объявление знаковой целочисленной переменной типа int c последующей инициализацией;
    std::int32_t waist{42};                                                        // Объявление знаковой целочисленной переменной типа int c последующей инициализацией;
    std::int32_t inseam{42};                                                       // Объявление знаковой целочисленной переменной типа int c последующей инициализацией;
    std::cout << "Параметры человека для подбора одежды:\n";
    std::cout << "Грудь = " << chest << " (42 в десятичной системе счисления).\n"; // Изначально объект cout имеет десятичную форму (dec);
    std::cout << std::hex;                                                         // Для отображения значения 42 в шестнадцатеричной форме, к объекту cout применятся манипулятор hex;
    std::cout << "Талия = " << waist << " (42 в шестнадцатеричной системе счисления 2А).\n";
    std::cout << std::oct;                                                         // Для отображения значения 42 в восьмеричной форме, к объекту cout применятся манипулятор oct;
    std::cout << "Длина внутреннего шва брюк = " << inseam << " (42 в восьмеричной системе исчисления 52).\n";
}



// Стандарт С++23/С++26:
/*
//import std;
#include <print>
#include <cstdint>               // Подключение типов данных с гарантированным фиксированным размером в битах;

int main()
{
    std::int32_t chest{42};                                                          // Объявление знаковой целочисленной переменной типа int c последующей инициализацией;
    std::int32_t waist{42};                                                          // Объявление знаковой целочисленной переменной типа int c последующей инициализацией;
    std::int32_t inseam{42};                                                         // Объявление знаковой целочисленной переменной типа int c последующей инициализацией;
    std::println("Параметры человека для подбора одежды:");
    std::println("Грудь {} (42 в десятичной системе счисления).", chest); // Изначально объект println имеет десятичную форму (:d);
    std::println("Талия = {:x} (42 в шестнадцатеричной системе счисления 2А).", waist);                 // Для отображения в шестнадцатеричной системе исчисления применяется спецификатор :x;
    std::println("Длина внутреннего шва брюк = {:o}(42 в восьмеричной системе исчисления 52).", inseam); // Для отображения в восьмеричной системе исчисления применяется спецификатор :o;
}
*/

