// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    char ch;                                            // Объявление беззнаковой символьной переменной;
    cout << "Введите символ:" << endl;
    cin >> ch;
    cout << "Хорошо! ";
    cout << "Вы ввели " << ch << " символ." << endl;
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>

int main()
{
    char ch;                                            // Объявление беззнаковой символьной переменной;
    std::cout << "Введите символ:\n";
    std::cin >> ch;
    std::cout << "Хорошо! ";
    std::cout << "Вы ввели " << ch << " символ.\n";
}



// Стандарт С++23/С++26:

//import std;
/*
#include <iostream>
#include <print>

int main()
{
    char ch;                                            // Объявление беззнаковой символьной переменной;
    std::println("Введите символ:");
    std::cin >> ch;
    std::print("Хорошо! ");
    std::println("Вы ввели {} символ.", ch);
}
*/

/*
Тип char и std::int8_t - это не совсем одно и тоже. Тот и другой тип объявления имеют 8 бит.
Но std::int8_t - предназначен только для цифр, а char для цифр и символов.
Когда в программе необходимо использовать символы объявление через "char".
*/
