// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    cout.setf(ios_base::fixed, ios_base::floatfield);   // Включает режим вывода чисел с плавающей точкой в фиксированном формате, вывод через экспоненту запрещен;
    float tub = 10.0 / 3.0;                             // Инициализация переменной типа float. Результат выражения присвоится переменной;
    double mint = 10.0 / 3.0;                           // Инициализация переменной типа double. Результат выражения присвоится переменной;
    const float million = 1.0e6;                        // Инициализация переменной типа float. Переменной присвоится значение 1 000 000. Квалификатор const защищает от случайного изменения значения переменной;

    cout << "Переменная типа float = " << tub;          // Гарантированная точность типа float составляет до 6-7 значащих цифр всего;
    cout << ", миллион значений типа float = " << million * tub;  // При умножении значения на миллион, значащие цифры в хвосте начнут искажаться;
    cout << ",\nи 10 умножить на миллион значений типа float = ";
    cout << 10 * million * tub << endl;                 // Умножая на 10, искаженное значащее значение перейдет в целую часть, наглядно показывая потерю точности;

    cout << "Значение типа double = " << mint << " и миллион значений типа double = "; // Гарантированная точность типа double составляет до 15-16 значащих цифр всего;
    cout << million * mint << endl;                     // При умножении на миллион точность полностью сохраняется благодаря 64-битной структуре double, точность выдерживается после умножения на 1 000 000;
    return 0;
}
*/

/*
cout.setf(ios_base::fixed, ios_base::floatfield); — Функция cout.setf включает режим вывода чисел с плавающей точкой в фиксированном формате, вывод через экспоненту запрещен.
ios_base::fixed — включение флага вывода значения только в дробном формате, после точки выведутся значения не в экспоненциальной форме.
ios_base::floatfield — сброс всех предыдущих флагов форматирования и установка последнего флага.
 */


// Стандарт С++20:

#include <iostream>
#include <format>                                                   // Подключение библиотеки форматирования текста;
constexpr const float Million{1.0e6f};                              // Безопасное определение константы с приведением типа float, которой присваивается значение 1 000 000. Квалификатор const защищает от случайного изменения значения переменной;

int main()
{
    float tub{10.0f / 3.0f};                                        // Безопасная списковая инициализация вещественного типа float. Результат выражения присвоится переменной;
    double mint{10.0 / 3.0};                                        // Безопасная списковая инициализация вещественного типа double. Результат выражения присвоится переменной;

    std::cout << std::format("Переменная типа float = {:f}", tub); // Гарантированная точность типа float составляет до 6-7 значащих цифр всего;
    std::cout << std::format(", миллион значений типа float = {:f}\n", Million * tub);  // При умножении значения на миллион, значащие цифры в хвосте начнут искажаться;
    std::cout << "и 10 умножить на миллион значений типа float = ";
    std::cout << std::format("{:f}\n", 10.0f * Million * tub);// Умножая на 10, искаженное значащее значение перейдет в целую часть, наглядно показывая потерю точности;
    std::cout << std::format("Значение типа double = {:f} и миллион значений типа double = ", mint);  // Гарантированная точность типа double составляет до 15-16 значащих цифр всего;
    std::cout << std::format("{:f}\n", Million * mint);       // При умножении на миллион точность полностью сохраняется благодаря 64-битной структуре double, точность выдерживается после умножения на 1 000 000;
}


// Стандарт С++23/С++26:
/*
//import std;
#include <print>

constexpr const float Million{1.0e6f};                              // Безопасное определение константы с приведением типа float, которой присваивается значение 1 000 000. Квалификатор const защищает от случайного изменения значения переменной;

int main()
{
    float tub{10.0f / 3.0f};                                        // Безопасная списковая инициализация вещественного типа float. Результат выражения присвоится переменной;
    double mint{10.0 / 3.0};                                        // Безопасная списковая инициализация вещественного типа double. Результат выражения присвоится переменной;

    std::print("Переменная типа float = {:f}", tub);     // Гарантированная точность типа float составляет до 6-7 значащих цифр всего;
    std::println(", миллион значений типа float = {:f}", Million * tub);  // При умножении значения на миллион, значащие цифры в хвосте начнут искажаться;
    std::print("и 10 умножить на миллион значений типа float = ");
    std::println("{:f}", 10.0f * Million * tub);             // Умножая на 10, искаженное значащее значение перейдет в целую часть, наглядно показывая потерю точности;
    std::print("Значение типа double = {:f} и миллион значений типа double = ", mint);  // Гарантированная точность типа double составляет до 15-16 значащих цифр всего;
    std::println("{:f}", Million * mint);                    // При умножении на миллион точность полностью сохраняется благодаря 64-битной структуре double, точность выдерживается после умножения на 1 000 000;
}
*/

/*
В стандартах C++23/C++26 функции std::print и std::println имеют встроенный движок форматирования.
Они полностью избавляют код от вызовов std::format или std::cout <<, безопасно подставляя аргументы
на место фигурных скобок с автоматическим приведением вещественных чисел к фиксированному формату через {:f}.
*/


