// Стандарт С++11:
/*
#include <iostream>
#include <string>                               // Подключение заголовочного файла для использования объекта string;

int main()
{
    using namespace std;
    char charr1[20];                            // Объявление пустого массива из 20 элементов;
    char charr2[20] = "jaguar";                 // Инициализация массива из 20 элементов строкой;
    string str1;                                // Объявление пустого объекта строки;
    string str2 = "pantera";                    // Инициализация объекта строки;
    cout << "Введите животное из семейства кошачьих: ";
    cin >> charr1;                              // Предопределенный объект cin с помощью оператора ввода >> считывает введенную строку с клавиатуры до первого пробела или символа новой строки \n;
    cout << "Введите другое животное из семейства кошачьих: ";
    cin >> str1;                                // Предопределенный объект cin с помощью оператора ввода >> считывает введенную строку с клавиатуры до первого пробела или символа новой строки \n;
    cout << "Здесь несколько животных:\n";
    cout << charr1 << " " << charr2 << " "      // Предопределенный объект cout c помощью оператора << выводит строки с массивов и объектов string;
        << str1 << " " << str2
        << endl;
    cout << "3 буквой в слове " << charr2 << " является "
         << charr2[2] << endl;                  // Предопределенный объект cout с помощью оператора << выводит символ элемента под индексом 2 массива;
    cout << "3 буквой в слове " << str2 << " является "
         << str2[2] << endl;                    // Предопределенный объект cout c помощью оператора << выводит символ элемена под индексом 2 объекта строки;
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>
#include <format>
#include <string>                              // Подключение заголовочного файла для использования объекта string;
#include <string_view>                         // Подключение заголовочного файла для безопасного вывода срезов строк;

constexpr uint8_t ar_size{20};

int main()
{
    char charr1[ar_size];                      // Объявление пустого массива из 20 элементов;
    char charr2[ar_size] = "jaguar";           // Инициализация массива из 20 элементов строкой;
    std::string str1;                          // Объявление пустого объекта строки;
    std::string str2 = "pantera";              // Инициализация объекта строки;
    std::cout << "Введите животное из семейства кошачьих: ";
    std::cin.get(charr1, ar_size).get();     // Предопределенный объект cin с помощью метода .get считывает введенную строку с клавиатуры до символа новой строки \n в массив размером в 20 элементов. .get() освобождает от оставшегося символа \n, чтобы далее в программе вновь ввести слово;
    std::cout << "Введите другое животное из семейства кошачьих: ";
    std::getline(std::cin, str1);        // Функция getline считывает введенную строку с клавиатуры символы до новой строки \n в строковый объект. После символ \n автоматически отбрасывается, освобождая буфер ввода. Размер строкового объекта будет строго равен размеру введенных символов;
    std::cout << "Здесь несколько животных:\n";
    std::cout << std::format("{} {} {} {}\n", charr1, charr2, str1, str2);      // Предопределенный объект cout c помощью оператора << выводит отформатированные строки с массивов и объектов string;
    std::cout << std::format("3 буквой в слове {} является {}\n", charr2, charr2[2]);   // Предопределенный объект cout с помощью оператора << выводит отформатированный символ элемента под индексом 2 массива;
    std::string_view view_name(str1);                                                                           // Смотрим на объекта строки, определяя размер этого объекта;
    std::cout << std::format("3 буквой в слове {} является {}\n", str1, view_name.substr(4, 2));  // Предопределенный объект cout c помощью оператора << выводит отформатированный символ элемента с помщью метода .substr класса string_view, который обределяет 3 символ слова (только на кириллице).
                                                                                                                   // Символ кириллицы занимает 2 байта, для 3 буквы начинается с элемента по индекоом 4 (1 аргумент), и размер одного символа 2 байта (2 аргумент);
}



// Стандарт С++23/С++26:
/*
#include <iostream>
#include <print>
#include <string>                           // Подключение заголовочного файла для использования объекта string;
#include <string_view>                      // Подключение заголовочного файла для безопасного вывода срезов строк;

int main()
{
    std::string charr1;                     // Объявление пустого объекта строки;
    std::string charr2 = "ягуар";           // Инициализация объекта строки;
    std::string str1;                       // Объявление пустого объекта строки;
    std::string str2 = "пантера";           // Инициализация объекта строки;
    std::print("Введите животное из семейства кошачьих: ");
    std::getline(std::cin,charr1);    // Функция getline считывает введенную строку с клавиатуры символы до новой строки \n в строковый объект. После символ \n автоматически отбрасывается, освобождая буфер ввода. Размер строкового объекта будет строго равен размеру введенных символов
    std::print("Введите другое животное из семейства кошачьих: ");
    std::getline(std::cin, str1);     // Функция getline считывает введенную строку с клавиатуры символы до новой строки \n в строковый объект. После символ \n автоматически отбрасывается, освобождая буфер ввода. Размер строкового объекта будет строго равен размеру введенных символов;
    std::println("Здесь несколько животных:");
    std::println("{} {} {} {}", charr1, charr2, str1, str2);       // Функция println выводит отформатированные строки объектов string;
    std::string_view view_name_1(charr2);                                              // Смотрим на объект строки, определяя размер;
    std::println("3 буквой в слове {} является {}", charr2, view_name_1.substr(4, 2));// Функция println выводит отформатированный символ элемента с помощью метода .substr класса string_view, который определяет 3 символ слова (только на кириллице);
    std::string_view view_name_2(str1);                                                // Смотрим на объект строки, определяя размер;
    std::println("3 буквой в слове {} является {}", str1, view_name_2.substr(4, 2));  // Функция println выводит отформатированный символ элемента с помощью метода .substr класса string_view, который определяет 3 символ слова (только на кириллице).
                                                                                                       // Символ кириллицы занимает 2 байта, для 3 буквы начинается с элемента по индекоом 4 (1 аргумент), и размер одного символа 2 байта (2 аргумент);
}
*/