// Стандарт С++23/С++26

#include <print>
#include <string>
#include <variant>   // Замена опасного union;
#include <bitset>    // Безопасная альтернатива битовым полям;
#include <bit>       // Для std::bit_cast;
#include <cstdint>

// 1. Safe Enum: Безопасное (ограниченное) перечисление. Защищает от путаницы типов.
// Явно задаем тип uint8_t (1 байт), чтобы экономить память.
namespace                                               // namespace - пространство имен, которое сообщает компилятору, что данная структура будет использоваться только в файле main.cpp, тем самым защищая от конфликтов имен, в случае расширении программы;
{
    enum class TransactionStatus : std::uint8_t         // enum class - класс для создание безопасного перечисления. TransactionStatus - перечисляемый тип данных. : std::uint8_t - указывает компилятору, что перечислимый тип занимает 8 бит;
    {
        Pending,                                        // Константе по молчанию присвоится 0;
        Approved,                                       // Константе по молчанию присвоится 1;
        Rejected                                        // Константе по молчанию присвоится 2;
    };
}

// 2. Safe Bit Fields: Используем std::bitset для флагов безопасности.
// 4 бита под настройки доступа (например: [0]-чтение, [1]-запись, [2]-VIP, [3]-крипто).
using AccountFlags = std::bitset<4>;                    // using - создает псевдоним AccountFlags для сложного типа std::bitset<4>.
                                                        // std::bitset<4> - безопасный контейнер C++, который выделяет из памяти ровно 4 бита для независимого управления флагами доступа (например: [0]-чтение, [1]-запись, [2]-VIP, [3]-крипто). То что AccountFlags может использовать;


namespace                                               // namespace - пространство имен, которое сообщает компилятору, что данная структура будет использоваться только в файле main.cpp, тем самым защищая от конфликтов имен, в случае расширении программы;
{
    // Современная структура банковского платежа
    struct Payment                                      // Объявление структуры типа Payment;
    {
        std::string target_account{};                   // Поле структуры: инициализированный объект строки под именем target_account, который не имеет ни одного символа;
        double amount{0.0};                             // Поле структуры: инициализированная переменная типа double значением 0.0;

        // 3. Safe Union: std::variant. Может хранить ЛИБО строку с ошибкой, ЛИБО флаги аккаунта.
        // В отличие от union, variant помнит, что в нем лежит, и не позволит прочитать мусор.
        std::variant<std::string, AccountFlags> security_info{}; // Поле структуры security_info, которое может хранить в памяти объект строки std::string или флаг пользователя объекта AccountFlags;
                                                                 // security_info - переменная типа данных контейнера-объекта std::variant;
        TransactionStatus status{TransactionStatus::Pending};    // Имя status переменной типа перечислений TransactionStatus, которая инициализируется по умолчанию константой Pending из этого перечисления;
    };
}

int main()
{
    // Задаем флаги: выставляем биты 0 и 2 в true (например, чтение и VIP-статус)
    AccountFlags flags;                                 // Объявление объекта flags типа AccountFlags из 4 флагов;
    flags.set(0);                                // Метод .set объекта flags устанавливает флаг 0 в true;
    flags.set(2);                                // Метод .set объекта flags устанавливает флаг 2 в true;

    // Создаем транзакцию с помощью безопасного variant и enum class
    const Payment tx                                    // Объявление инициализация константного объекта tx типа структуры Payment. Квалификтаор const защищает данные полей от случайного изменения;
    {
        .target_account = "NL99BANK0123456789",      // Поле target_account инициализируется строковым литералом, представляющее номер счета получателя;
        .amount = 1500.50,                              // Поле amount инициализируется значением типа double, представляющее платеж с банковского счета;
        .security_info = flags,                      // Поле security_info типа std::variant переключается на хранение объекта типа AccountFlags;
        .status = TransactionStatus::Approved           // Поле status инициализируется константой Approved из перечисления TransactionStatus. Платеж на сумму 1500.50 переходит в статус "Одобрен";
    };

    // 4. Безопасный вывод enum class. Неявное приведение к числу запрещено, приводим явно.
    std::println("Статус транзакции (числовой код): {}", static_cast<std::uint8_t>(tx.status)); // Функция std::println выводит отформатированную строку. static_cast<std::uint8_t>(tx.status) выполняет явное приведение значения поля status объекта tx к беззнаковому типу uint8_t (в данном случае к числу 1) для вывода на экран;

    // Проверяем, что лежит внутри variant, с помощью функции std::holds_alternative
    if (std::holds_alternative<AccountFlags>(tx.security_info)) // Функция std::holds_alternative проверяет, хранит ли сейчас контейнер tx.security_info тип данных AccountFlags. Если да, функция вернет true и выполнится блок оператора if;
    {
        // std::get безопасно извлекает данные. Если бы там была строка, программа бы не прочитала мусор, а выдала ошибку.
        auto current_flags = std::get<AccountFlags>(tx.security_info);                                 // Инициализация перменной current_flags автоматического типа, в которую функция std::get безопасно извлекает данные из поля tx.security_info типа std::variant;
        std::println("Битовая маска безопасности платежа: {}", current_flags.to_string());      // Функция std::println выводит отформатированную строку. Метод to_string() берет у переменной биты и преобразует в строку для вывода сообщения на консоль;
    }                                                                                                  // Выведется 0101, по причине, что при изначальной установке флагов типа AccountFlags флаги под индексами 0 и 2 установили в единицы, флаги под индесами 1 и 3 не устанавливали, по умолчанию установлены в 0;

    if (tx.status == TransactionStatus::Rejected)       // Если значение поля status объекта tx совпадает с константой Rejected перечислимого типа TransactionStatus, то выполняется блок оператора if;
    {
        std::println("Платеж был отклонен!");    // Функция std::println выводит сообщение на консоль;
    }


    // 5. БОНУС: std::bit_cast (C++20). Самый безопасный способ интерпретировать байты как другой тип.
    // Пересылаем сумму double в виде сырых байт uint64_t по сети без нарушения правил языка (Strict Aliasing).
    double money = 99.99;                                                                              // Инициализация переменной типа double;
    auto raw_bytes = std::bit_cast<std::uint64_t>(money);                                              // Инициализация переменной raw_bytes автоматического типа. Функция std::bit_cast вслепую копирует сырые двоичные биты из переменной money, позволяя программе прочитать их как целое число uint64_t без математического изменения;
    std::println("Байты числа double 99.99, представленные как целое число: {}", raw_bytes);// Функция std::println выводит отформатированную строку со значением переменной raw_bytes;
}

/*
  В памяти число типа double записано в двойчном виде, но когда приводим к uint64_t, все биты у представляют большое десятичное число. И это число println отображает.
*/
