// Стандарт С++11:
/*
#include <iostream>                         // Директива препроцессора. Подключение заголовочного файла ввода-вывода;

static int stonetolb(int);                  // Прототип функции, которая принимает целочисленное знаковое значение и возвращает целочисленное знаковое значение;
                                            // Квалификатор static делает функцию видимой только для этого файла;
int main()                                  // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    using namespace std;                    // Открывает все имена из пространства std целиком, убирая необходимость писать префиксы;
    int stone;                              // Объявление переменной;
    cout << "Введите вес в стоунах: ";      // Вывод сообщения в поток консоли с помощью предопределенного объекта cout и оператора вставки <<;
    cin >> stone;                           // Ввод сообщения (значения) из потока консоли предопределенного объекта cin и оператора извлечения >> (извлечения в переменную);
    int pounds = stonetolb(stone);          // Объявление переменной, которой присваивается (инициализация) результат функции;
    cout << stone << " стоун(ов) = ";       // Вывод сообщения в поток консоли с помощью предопределенного объекта cout и оператора вставки <<;
    cout << pounds << " фунтов." << endl;   // Сцепление (каскадирование) операторов << для вывода нескольких элементов в поток за один раз;
    return 0;
}

static int stonetolb(int sts)               // Определение функции;
{
    return 14 * sts;                        // Функция с помощью оператора return возвращает результат работы функции;
}
*/


// Стандарт С++20:

#include <iostream>                         // Директива препроцессора. Подключение заголовочного файла ввода-вывода;

static int stonetolb(int);                  // Прототип функции, которая принимает целочисленное знаковое значение и возвращает целочисленное знаковое значение;
                                            // Квалификатор static делает функцию видимой только для этого файла;
int main()                                  // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    int stone;                              // Объявление переменной;
    std::cout << "Введите вес в стоунах: "; // Префикс std:: указывает компилятору, что предопределенный объект cout берется из стандартной библиотеки и оператор потока вывода (вставки) <<;
    std::cin >> stone;                      // Префикс std:: указывает компилятору, что предопределенный объект cin берется из стандартной библиотеки и оператор потока ввода (извлечения) >>, при вводе значения, извлекается из консоли значение и присваивается переменной;
    int pounds = stonetolb(stone);          // Объявление переменной, которой присваивается (инициализация) результат функции;
    std::cout << stone << " стоун(ов) = " << pounds << " фунтов.\n"; // Сцепление (каскадирование) операторов << для вывода нескольких элементов в поток за один раз;
}

static int stonetolb(int sts)               // Определение функции;
{
    return 14 * sts;                        // Функция с помощью оператора return возвращает результат работы функции;
}


// Стандарт С++23/С++26:
/*
import std;                                                  // Заменяет #include <iostream>. import std включает в себя все функции ввода-вывода и современной печати;

static int stonetolb(int);                                   // Прототип функции. Квалификатор static оставляет её видимой только в этом файле;

int main()                                                   // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    int stone;                                               // Объявление переменной;
    std::print("Введите вес в стоунах: ");                   // Функция print выводит текст без перевода на новую строку;
    std::cin >> stone;                                       // Ввод значения из консоли в переменную stone;
    int pounds = stonetolb(stone);                           // Вызов функции stonetolb и инициализация переменной pounds;
    std::println("{} стоун(ов) = {} фунтов.", stone, pounds); // Функция println сама автоматически переводит строку в конце. Переменные stone и pounds переданы через запятую для подстановки в фигурные скобки {};
}

static int stonetolb(int sts)                               // Определение функции перевода стоунов в фунты;
{
    return 14 * sts;                                        // Функция с помощью оператора return возвращает результат работы функции;
}
*/