// Стандарт С++11:
/*
#include <iostream>
#include <string>                                   // Подключение заголовочного файла для применения класса string;
#include <cstring>                                  // Подключение заголовочного файла для применения функций С;

int main()
{
    using namespace std;
    char charr[20];                                 // Объявление пустого массива размером 20 элементов;
    string str;                                     // Объявление пустого объекта строки;
    cout << "Длина строки в charr перед вводом: "   // Предопределенный объект cout с помощью оператора << выводит с помощью функции strlen размер массива charr;
         << strlen(charr) << endl;
    cout << "Длина строки в str перед вводом: "     // Предопределенный объект cout с помощью оператора << выводит с помощью метода класса string .size() размер объекта строки;
         << str.size() << endl;
    cout << "Введите строку текста:\n";
    cin.getline(charr, 20);                       // Предопределенный объект cin применяет функцию (метод) getline для ввода строки. Функция принимает массив, куда запишется строка, и максимальный размер, который имеет массив. getline принимает строку до символа ввода \n, который заменится на \0;
    cout << "Вы ввели: " << charr << endl;          // Предопределенный объект cout с помощью оператора << выводит строку массива charr;
    cout << "Введите другую строку текста:\n";
    getline(cin, str);                        // Функция getline для ввода строки принимает предопределенный объект cin и объект строки куда запишется строка;
    cout << "Вы ввели: " << str << endl;            // Предопределенный объект cout с помощью оператора << выводит содержимое объекта строки;
    cout << "Длина строки в массиве charr после ввода: "
         << strlen(charr) << endl;                  // Предопределенный объект cout с помощью оператора << выводит с помощью функции strlen размер массива charr;
    cout << "Длина строки в объекте строки str после ввода: "
         << str.size() << endl;                     // Предопределенный объект cout с помощью оператора << выводит с помощью метода класса string .size() размер объекта строки;
    return 0;
}
*/
/*
  Ввод английскими буквами. Для данной программы необъодимо вводить слова через пробел;
*/


// Стандарт С++20:

#include <iostream>
#include <string>                                        // Подключение заголовочного файла для применения класса string;
#include <format>
#include <cstdint>
#include <cwchar>                                        // Подключение заголовочного файла для применения широких строк С;
#include <locale>                                        // подключение заголовочного файла для вывода кириллических символов;

constexpr uint8_t ar_size{20};

int main()
{
    setlocale(LC_ALL, "");                 // Для отображения текста на русском языке;
    wchar_t charr[ar_size]{};                            // Объявление пустого массива размером 20 широких символов с принудительным занулением элементов;
    std::wstring str;                                    // Объявление пустого объекта широкой строки;
    std::wcout << std::format(L"Длина строки в charr перед вводом: {}\n", // Предопределенный объект wcout выводит отформатированное значение функции wcslen, определяющая размер массива charr;
                 wcslen(charr));
    std::wcout << std::format(L"Длина строки в str перед вводом: {}\n",   // Предопределенный объект wcout выводит отформатированное значение метода класса wstring .size(), которое определяет размер объекта широкой строки;
                 str.size());
    std::wcout << L"Введите строку текста:\n";
    std::wcin.getline(charr, ar_size);                 // Предопределенный объект wcin применяет функцию (метод) getline для ввода широкой строки. Функция принимает массив, куда запишется строка, и максимальный размер, который имеет массив. getline принимает строку до символа ввода \n, который заменится на \0;
    std::wcout << std::format(L"Вы ввели: {}\n", charr);  // Предопределенный объект wcout  выводит отформатированную широкую строку массива charr;
    std::wcout << L"Введите другую строку текста:\n";
    getline(std::wcin, str);                       // Функция getline для ввода строки принимает предопределенный объект wcin и объект широкой строки куда запишется строка;
    std::wcout << std::format(L"Вы ввели: {}\n", str);    // Предопределенный объект wcout выводит отформатированное содержимое объекта широкой строки;
    std::wcout << std::format(L"Длина строки в массиве charr после ввода: {}\n",
                 wcslen(charr));                  // Предопределенный объект wcout выводит отформатированное значение, которое определяет функции wcslen (размер массива charr);
    std::wcout << std::format(L"Длина строки в объекте строки str после ввода: {}\n",
                 str.size());                     // Предопределенный объект wcout выводит отформатированное занчение, которое определяет метод класса wstring .size() (размер объекта широкой строки);
}


/*
  Под термином "широкая строка" подразумевается, что абсолютно любой символ (как кириллический,
так и английский) имеет увеличенный фиксированный размер — обычно 2 байта в Windows или 4 байта в Linux,
в отличие от стандартного типа char, где на символ выделяется 1 байт. Чтобы продемонстрировать работу
с кириллическими символами, применяя массивы и объекты строки, задействован заголовочный файл <cwchar>,
который заменяет функцию strlen на wcslen, strcpy на wcscpy, strcat на wcscat, а также расширенные типы wchar_t и
объект строки wstring. И для вывода строки на консоль вместо предопределенного объекта cout применяется
wcout для широких строк.
  Данный код при переносе на другую ОС может работать некорректно (из-за разного размера wchar_t в разных системах).

  Для безопасной работы и переносимости программы используется другой подход, который описан в стандарте С++23/С++26 ниже.
*/


// Стандарт С++23/С++26
/*
#include <iostream>
#include <print>
#include <string>                                       // Подключение заголовочного файла для применения класса string;
#include <string_view>                                  // Подключение заголовочного файла некопирующихся строк и определения размера строки;
#include <ranges>                                       // Подключения заголовочного файла для диапазонов ranges;

static constexpr size_t count_utf8_letters(std::string_view str) noexcept // Квалификатор static делает функцию видимой только в файле main.cpp, защища от конфликтов имен при расширении программы.
{                                                       // constexpr сообщает компилятору, что код можно максимально оптимизировать. Функция принимает std::string_view (взгляд на строку) для чтения из памяти, чтобы определить размер, но не копирует ее в память. Функция возвращает беззнаковое значение типа size_t;
                                                        // Квалификатор noexcept дает знать компилятору, что не возникнит никаких исключений, что позволяет компилятору максимально оптимизировать код
    auto letters = str | std::views::filter([](char c) // auto letters - компилятор автоматически определяет сложный тип диапазона. letters - хранит ссылку-инструкцию (view) на оригинальную строку и правило фильтрации. str - исходная строка. "|" - оператор конвеера.  std::views::filter - сито для фильтрации.
    {                                                           // [] - начало лямбда-функции, (char c) - текущий байт с конвеера с именем "с" для последующей проверки внутри тела {...}.
        return (static_cast<unsigned char>(c) & 0xC0) != 0x80;  // static_cast - преобразует знаковый char в беззнаковый. & 0xC0 - побитовая маска (1100 0000), оставляющая только первые два бита. != 0x80 (1000 0000) - проверка: если первые два бита НЕ равны 10, возвращается true (байт пропускается в поток letters), если равны (это продолжающий байт кириллицы), возвращается false (байт отсекается).
    });
    return std::ranges::distance(letters);                  // std::ranges::distance - запускает перебор по ригинальной строке через инструкцию letter, по очереди подсчитывает количество успешно прошедших элементов, после чего оператор return возвращает это число их функции;
}

int main()
{
    std::string charr{};                            // Объявление пустого объекта строки;
    std::string str{};                              // Объявление пустого объекта строки;
    size_t len1 = count_utf8_letters(charr);     // Вызов функции для подсчета кириллических символов. Функция принимает объект строки. Результат присвоится беззнаковой переменно типа size_t;
    size_t len2 = count_utf8_letters(str);       // Вызов функции для подсчета кириллических символов. Функция принимает объект строки. Результат присвоится беззнаковой переменно типа size_t;
    std::println("Длина строки в charr перед вводом: {}", len1); // Функция println выводит отформатированное значение переменной len1;
    std::println("Длина строки в str перед вводом: {}", len2);   // Функция println выводит отформатированное значение переменной len2;
    std::println("Введите строку текста:");
    getline(std::cin,charr);                  // Функция getline для ввода строки принимает предопределнный объект cin и объект строки куда запишется строка getline принимает строку до ввода, а конец добавляется \0;
    std::println("Вы ввели: {}", charr); // Функция println выводит отформатированную строку объекта строки;
    std::println("Введите другую строку текста:");
    getline(std::cin, str);                   // Функция getline для ввода строки принимает предопределнный объект cin и объект строки куда запишется строка getline принимает строку до ввода, а конец добавляется \0;
    std::println("Вы ввели: {}", str);   // Функция println выводит отформатированную строку объекта строки;
    len1 = count_utf8_letters(charr);            // Вызов функции для подсчета кириллических символов. Функция принимает объект строки. Результат присвоится беззнаковой переменно типа size_t;
    std::println("Длина строки в массиве charr после ввода: {}", len1); // Функция println выводит отформатированное значение переменной len1;
    len2 = count_utf8_letters(str);              // Вызов функции для подсчета кириллических символов. Функция принимает объект строки. Результат присвоится беззнаковой переменно типа size_t;
    std::println("Длина строки в объекте строки str после ввода: {}", len2); // Функция println выводит отформатированное значение переменной len1;
}
*/

/*
   При вызове функции count_utf8_letters, которая примает не саму строку, а взгляд на строку std::string_view, для определения ее размера.
Далее создается переменная letters, которая имеет автоматический тип (для переносимости на другую ОС). Данная переменная хранит ссылку-инструкцию на оригинальный объект строки str.
str | std::views::filter([](char c) - фильтр, который пропускает через себя оригинальную строку по байту (мини инструкция как фильтровать [](char c), по 8 бит.
Далее оператор return (static_cast<unsigned char>(c) & 0xC0) != 0x80; пропустится и очередь выполнения программы перейдет на строку return std::ranges::distance(letters);.
std::ranges::distance запускает перебор по оригинальной строке через инструкцию letters, т.е. следущий шаг программы переходит на оператор return (static_cast<unsigned char>(c) & 0xC0) != 0x80;.
В данном операторе происходит перебор оригинальной строки. Первый байт кириллической буквы начинается с кода 0хС0 (1100 0000),  второй с 0х80 (1000 0000).
Задача программы проигнорировать все продолжающиеся байты, которые имею первые два бита 10..., что означает продолжения кода символа.
Каждый байт проходит через наложение маски 0хС0 (1100 0000), т.е. всегда остаутся в 1 либо первые два бита, либо 1 бит. Далее идет проверка этого байта с 0х80 (1000 0000).
Если в результате сравнения будет не равно, лямбда-функция выдаст true и функции std::ranges::distance добавляется к счету 1, если равен, лямбда-функция выдаст выдаст false, байт отсекается,
функция std::ranges::distance ничего не добавит и не убавит.
Цикл происходит до тех пор, пока все символы строки не перебирутся. Дальше стандартная функция std::ranges::distance(letters), выдает общее количество итераций, т.е. сколько раз функция инструкция letter
выдала true.
*/