// Стандарт С++11:
/*
#include <iostream>
#include <string>                                   // Подключение заголовочного файла для применения класса string;
#include <cstring>                                  // Подключение заголовочного файла для применения функций С;

int main()
{
    using namespace std;
    char charr[20];                                 // Объявление пустого массива размером 20 элементов;
    string str;                                     // Объявление пустого объекта строки;
    cout << "Длина строки в charr перед вводом: "   // Предопределенный объект cout с помощью оператора << выводит с помощью функции strlen размер массива charr;
         << strlen(charr) << endl;
    cout << "Длина строки в str перед вводом: "     // Предопределенный объект cout с помощью оператора << выводит с помощью метода класса string .size() размер объекта строки;
         << str.size() << endl;
    cout << "Введите строку текста:\n";
    cin.getline(charr, 20);                       // Предопределенный объект cin применяет функцию (метод) getline для ввода строки. Функция принимает массив, куда запишется строка, и максимальный размер, который имеет массив. getline принимает строку до символа ввода \n, который заменится на \0;
    cout << "Вы ввели: " << charr << endl;          // Предопределенный объект cout с помощью оператора << выводит строку массива charr;
    cout << "Введите другую строку текста:\n";
    getline(cin, str);                        // Функция getline для ввода строки принимает предопределенный объект cin и объект строки куда запишется строка;
    cout << "Вы ввели: " << str << endl;            // Предопределенный объект cout с помощью оператора << выводит содержимое объекта строки;
    cout << "Длина строки в массиве charr после ввода: "
         << strlen(charr) << endl;                  // Предопределенный объект cout с помощью оператора << выводит с помощью функции strlen размер массива charr;
    cout << "Длина строки в объекте строки str после ввода: "
         << str.size() << endl;                     // Предопределенный объект cout с помощью оператора << выводит с помощью метода класса string .size() размер объекта строки;
}
*/
/*
  Ввод английскими буквами. Для данной программы необъодимо вводить слова через пробел;
*/


// Стандарт С++20:

#include <iostream>
#include <string>                                        // Подключение заголовочного файла для применения класса string;
#include <format>
#include <cstdint>
#include <cwchar>                                        // Подключение заголовочного файла для применения широких строк С;
#include <locale>                                        // подключение заголовочного файла для вывода кириллических символов;

constexpr uint8_t ar_size{20};

int main()
{
    setlocale(LC_ALL, "");                 // Для отображения текста на русском языке;
    wchar_t charr[ar_size]{};                            // Объявление пустого массива размером 20 широких символов с принудительным занулением элементов;
    std::wstring str;                                    // Объявление пустого объекта широкой строки;
    std::wcout << std::format(L"Длина строки в charr перед вводом: {}\n", // Предопределенный объект wcout выводит отформатированное значение функции wcslen, определяющая размер массива charr;
                 wcslen(charr));
    std::wcout << std::format(L"Длина строки в str перед вводом: {}\n",   // Предопределенный объект wcout выводит отформатированное значение метода класса wstring .size(), которое определяет размер объекта широкой строки;
                 str.size());
    std::wcout << L"Введите строку текста:\n";
    std::wcin.getline(charr, ar_size);                 // Предопределенный объект wcin применяет функцию (метод) getline для ввода широкой строки. Функция принимает массив, куда запишется строка, и максимальный размер, который имеет массив. getline принимает строку до символа ввода \n, который заменится на \0;
    std::wcout << std::format(L"Вы ввели: {}\n", charr);  // Предопределенный объект wcout  выводит отформатированную широкую строку массива charr;
    std::wcout << L"Введите другую строку текста:\n";
    getline(std::wcin, str);                       // Функция getline для ввода строки принимает предопределенный объект wcin и объект широкой строки куда запишется строка;
    std::wcout << std::format(L"Вы ввели: {}\n", str);    // Предопределенный объект wcout выводит отформатированное содержимое объекта широкой строки;
    std::wcout << std::format(L"Длина строки в массиве charr после ввода: {}\n",
                 wcslen(charr));                  // Предопределенный объект wcout выводит отформатированное значение, которое определяет функции wcslen (размер массива charr);
    std::wcout << std::format(L"Длина строки в объекте строки str после ввода: {}\n",
                 str.size());                     // Предопределенный объект wcout выводит отформатированное занчение, которое определяет метод класса wstring .size() (размер объекта широкой строки);
}


/*
  Под термином "широкая строка" подразумевается, что абсолютно любой символ (как кириллический,
так и английский) имеет увеличенный фиксированный размер — обычно 2 байта в Windows или 4 байта в Linux,
в отличие от стандартного типа char, где на символ выделяется 1 байт. Чтобы продемонстрировать работу
с кириллическими символами, применяя массивы и объекты строки, задействован заголовочный файл <cwchar>,
который заменяет функцию strlen на wcslen, strcpy на wcscpy, strcat на wcscat, а также расширенные типы wchar_t и
объект строки wstring. И для вывода строки на консоль вместо предопределенного объекта cout применяется
wcout для широких строк.
  Данный код при переносе на другую ОС может работать некорректно (из-за разного размера wchar_t в разных системах).

  Для безопасной работы и переносимости программы используется другой подход, который описан в стандарте С++23/С++26 ниже.
*/
