// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    cout << "\aОперация \"Ввода кода в систему\" активирована!\n";          // С помощью управляющей последовательности \a при выполнении оператора, раздастся звуковой сигнал (если это позволяет компилятор). \" - позволяет в тексте отобразить кавычки;
    cout << "Введите код агента: ________\b\b\b\b\b\b\b\b";                 // Управляющая последовательность \b переставляет курсор назад на один шаг, подготавливая позицию для ввода пользователя поверх линий;
    long code;
    cin >> code;
    cout << "\aВы ввели " << code << "...\n";                               // При управляющей последовательности \а раздастся звуковой сигнал (если позволяет компилятор);
    cout << "\aКод подтвержден! Приступайте к выполнению плана b52!\n";     // При управляющей последовательности \а раздастся звуковой сигнал (если позволяет компилятор);
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>

int main()
{
    std::cout << "\aОперация \"Ввода кода в систему\" активирована!\n";          // С помощью управляющей последовательности \a при выполнении оператора, раздастся звуковой сигнал (если это позволяет компилятор). \" - позволяет в тексте отобразить кавычки;
    std::cout << "Введите код агента: ________\b\b\b\b\b\b\b\b";                 // Управляющая последовательность \b переставляет курсор назад на один шаг, подготавливая позицию для ввода пользователя поверх линий;
    std::string code;                                                            // Заменяет тип char по причине, то данный тип в стандарте UTF-8 выводит только первый 128 символов таблицы ASCII;
    std::cin >> code;
    std::cout << "\aВы ввели " << code << "...\n";                               // При управляющей последовательности \а раздастся звуковой сигнал (если позволяет компилятор);
    std::cout << "\aКод подтвержден! Приступайте к выполнению плана b52!\n";     // При управляющей последовательности \а раздастся звуковой сигнал (если позволяет компилятор);
}



// Стандарт С++23/С++26:
/*
//import std;                                                // Заменяет #include <iostream>. import std включает в себя все функции ввода-вывода и современной печати;
#include <iostream>                                          // Директива препроцессора. Подключение заголовочного файла ввода-вывода;
#include <print>

int main()
{
    std::println("\aОперация \"Ввода кода в систему\" активирована!");         // С помощью управляющей последовательности \a при выполнении оператора, раздастся звуковой сигнал (если это позволяет компилятор). \" - позволяет в тексте отобразить кавычки;
    std::print("Введите код агента: ________\b\b\b\b\b\b\b\b");                // Управляющая последовательность \b переставляет курсор назад на один шаг, подготавливая позицию для ввода пользователя поверх линий;
    std::string code;                                                          // Заменяет тип char по причине, то данный тип в стандарте UTF-8 выводит только первый 128 символов таблицы ASCII;
    std::cin >> code;
    std::println("\aВы ввели {} ...\n", code);                                 // При управляющей последовательности \а раздастся звуковой сигнал (если позволяет компилятор);
    std::println("\aКод подтвержден! Приступайте к выполнению плана b52!");    // При управляющей последовательности \а раздастся звуковой сигнал (если позволяет компилятор);
}
*/


// ТАБЛИЦА УПРАВЛЯЮЩИХ ПОСЛЕДОВАТЕЛЬНОСТЕЙ C++:
/*
========================================================================================================

| Название символа                          | Символ ASCII | Код C++ | Дес. код ASCII | Шестн. код ASCII |
========================================================================================================

| Новая строка (Line Feed)                  | NL (LF)      | \n      | 10             | 0x0A             |
| Горизонтальная табуляция                  | HT           | \t      | 9              | 0x09             |
| Вертикальная табуляция                    | VT           | \v      | 11             | 0x0B             |
| Забой (Шаг назад / Backspace)             | BS           | \b      | 8              | 0x08             |
| Возврат каретки (Carriage Return)         | CR           | \r      | 13             | 0x0D             |
| Предупреждение (Системный писк / Bell)    | BEL          | \a      | 7              | 0x07             |
| Обратная косая черта (Бэкслеш)            | \            | \\      | 92             | 0x5C             |
| Знак вопроса                              | ?            | \?      | 63             | 0x3F             |
| Одинарная кавычка (Апостроф)              | '            | \'      | 39             | 0x27             |
| Двойная кавычка                           | "            | \"      | 34             | 0x22             |
========================================================================================================
*/
