// Стандарт С++11:
/*
#include <iostream>
#include <string>                                   // Подключение заголовочного файла для применения класса string;
#include <cstring>                                  // Подключение заголовочного файла для применения функций С;

int main()
{
    using namespace std;
    char charr1[20];                                // Объявление пустого массива из 20 элементов;
    char charr2[20] = "jaguar";                     // Инициализация массива из 20 элементов строковым литералом;
    string str1;                                    // Объявление пустового объекта строки;
    string str2 = "panther";                        // Инициализация объекта строки строковым литералом;
    str1 = str2;                                    // Объекту строки str1 копируется (присваивается) строка объекта строки str2;
    strcpy(charr1, charr2);                         // Строка массива charr2 копируется (присваивается) массиву charr1 при помощи функции C strcpy;
    str1 += " paste";                               // К строке объекту строки str1 добавляется строковый литерал;
    strcat(charr1, " juice");                   // К строке массива charr1 добавляется строковый литерал при помощи функции С strcat;
    int len1 = str1.size();                         // Метод .size() класса string определяет количество символов в объекте строки str1. Результат присваивается переменной;
    int len2 = strlen(charr1);                      // Функция С strlen определяет количество символов массива charr1. Результат присваивается переменной;
    cout << "Строка " << str1 << " содержит "       // Предопределнный объект cout при помощи оператора << выводит содержимое объекта строки и значение переменной;
          << len1 << " символов.\n";
    cout << "Массив " << charr1 << " содержит "     // Предопределнный объект cout при помощи оператора << выводит содержимое массива и значение переменной;
         << len2 << " символов.\n";
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>
#include <format>
#include <cstdint>
#include <string>                                   // Подключение заголовочного файла для применения класса string;
#include <cwchar>                                   // Подключение заголовочного файла для применения функций широких строк С;
#include <locale>                                   // Подключение заголовочного файла для вывода кириллических символов на консоль;

constexpr uint8_t ar_size{20};

int main()
{
    setlocale(LC_ALL, "");
    std::wcout.imbue(std::locale(""));         // Нстройка потока вывода на консоль в кириллических символах;
    wchar_t charr1[ar_size];                         // Объявление пустого массива из 20 широких элементов;
    wchar_t charr2[ar_size] = L"ягуар";              // Инициализация массива из 20 широких элементов широким строковым литералом;
    std::wstring str1{};                             // Объявление пустового объекта широкой строки;
    const std::wstring str2 = L"пантера";            // Инициализация объекта широкоой строки широким строковым литералом;
    str1 = str2;                                     // Объекту широкой строки str1 копируется (присваивается) строка объекта широкой строки str2;
    wcscpy(charr1, charr2);                          // Широкая строка массива charr2 копируется (присваивается) массиву charr1 при помощи функции C wcscpy;
    str1 += L" паста";                               // К широкой строке объекту строки str1 добавляется широкий строковый литерал;
    wcscat(charr1, L" сок");                     // К широкой строке массива charr1 добавляется широкий строковый литерал при помощи функции С wcscat;
    uint32_t len1 = str1.size();                     // Метод .size() класса string определяет количество символов в объекте широкой строки str1. Результат присваивается переменной;
    uint32_t len2 = wcslen(charr1);                  // Функция С wcslen определяет количество широких символов массива charr1. Результат присваивается переменной;
    std::wcout << std::format(L"Строка {} содержит {} символов.\n", str1, len1);   // Предопределнный объект wcout при помощи оператора << выводит отформатированное содержимое объекта широкой строки и значение переменной;
    std::wcout << std::format(L"Массив {} содержит {} символов.\n", charr1, len2); // Предопределнный объект wcout при помощи оператора << выводит отформатированное содержимое массива и значение переменной;
}


/*
  Под термином "широкая строка" подразумевается, что абсолютно любой символ (как кириллический,
так и английский) имеет увеличенный фиксированный размер — обычно 2 байта в Windows или 4 байта в Linux,
в отличие от стандартного типа char, где на символ выделяется 1 байт. Чтобы продемонстрировать работу
с кириллическими символами, применяя массивы и объекты строки, задействован заголовочный файл <cwchar>,
который заменяет функцию strlen на wcslen, strcpy на wcscpy, strcat на wcscat, а также расширенные типы wchar_t и
объект строки wstring. И для вывода строки на консоль вместо предопределенного объекта cout применяется
wcout для широких строк.
  Данный код при переносе на другую ОС может работать некорректно (из-за разного размера wchar_t в разных системах).

  Для безопасной работы и переносимости программы используется другой подход, который описан в стандарте С++23/С++26 ниже.
*/



// Стандарт С++23/С++26
/*
#include <print>
#include <string>                                                // Подключение заголовочного файла для применения класса string;
#include <string_view>                                           // Подключение заголовочного файла некопирующихся строк и определения размера строки;
#include <ranges>                                                // Подключение заголовочного файла диапазонов ranges;

static constexpr size_t count_utf8_letters(std::string_view str) noexcept // Квалификатор static делает функцию видимой только для файла main.cpp, защищая от конфликтов имен при расширении программы.
{                                                                         // constexpr сообщает компилятору, что код можно максимально оптимизировать. Функция принимает std::string_view (взгляд на строку) для чтения напрямую из памяти без создания копии. Возвращает беззнаковое значение типа size_t.
                                                                          // Квалификатор noexcept дает знать компилятору, что в данной функции не возникнет исключений, что позволяет максимально оптимизировать код.
    auto letters = str | std::views::filter([](char c) // auto letters - компилятор автоматически определяет сложный тип диапазона; letters хранит ссылку-инструкцию (View) на оригинальную строку и правило фильтрации. str - исходная строка. "|" - оператор конвейера. std::views::filter - сито для фильтрации.
    {                                                                     // [] - начало лямбда-функции, (char c) - текущий байт с конвейера, которому дается имя "c" для последующей проверки внутри тела функции {...}.
        return (static_cast<unsigned char>(c) & 0xC0) != 0x80;    // static_cast преобразует знаковый char в беззнаковый. & 0xC0 - побитовая маска (1100 0000), оставляющая только первые два бита. != 0x80 (1000 0000) - проверка: если первые два бита НЕ равны 10, возвращается true (байт пропускается в поток letters), если равны (это продолжающий байт кириллицы), возвращается false (байт отсекается).
    });
    return std::ranges::distance(letters);                    // std::ranges::distance запускает перебор по оригинальной строке через инструкцию letters, по очереди подсчитывает количество успешно прошедших элементов, после чего оператор return возвращает это число из функции.
}


int main()
{
    std::string text1 = "ягуар";                // Инициальзация объекта строки;
    std::string text2 = "пантера";              // Инициальзация объекта строки;
    text1 += " паста";                          // К объекту строки добавляется строковый литерал;
    text2 += " сок";                            // К объекту строки добавляется строковый литерал;
    size_t len1 = count_utf8_letters(text1); // Вызов функции count_utf8_letters, которая принимает объект строки для подсчета символов и возвращает значение типа size_t для инициализации переменной;
    size_t len2 = count_utf8_letters(text2); // Вызов функции count_utf8_letters, которая принимает объект строки для подсчета символов и возвращает значение типа size_t для инициализации переменной;
    std::println("Строка '{}' содержит {} символов.", text1, len1); // Функция выводит на консоль отформатированные строку и значение переменной;
    std::println("Строка '{}' содержит {} символов.", text2, len2); // Функция выводит на консоль отформатированные строку и значение переменной;
}
*/

/*
   При вызове функции count_utf8_letters, которая примает не саму строку, а взгляд на строку std::string_view, для определения ее размера.
Далее создается переменная letters, которая имеет автоматический тип (для переносимости на другую ОС). Данная переменная хранит ссылку-инструкцию на оригинальный объект строки str.
str | std::views::filter([](char c) - фильтр, который пропускает через себя оригинальную строку по байту (мини инструкция как фильтровать [](char c), по 8 бит.
Далее оператор return (static_cast<unsigned char>(c) & 0xC0) != 0x80; пропустится и очередь выполнения программы перейдет на строку return std::ranges::distance(letters);.
std::ranges::distance запускает перебор по оригинальной строке через инструкцию letters, т.е. следущий шаг программы переходит на оператор return (static_cast<unsigned char>(c) & 0xC0) != 0x80;.
В данном операторе происходит перебор оригинальной строки. Первый байт кириллической буквы начинается с кода 0хС0 (1100 0000),  второй с 0х80 (1000 0000).
Задача программы проигнорировать все продолжающиеся байты, которые имею первые два бита 10..., что означает продолжения кода символа.
Каждый байт проходит через наложение маски 0хС0 (1100 0000), т.е. всегда остаутся в 1 либо первые два бита, либо 1 бит. Далее идет проверка этого байта с 0х80 (1000 0000).
Если в результате сравнения будет не равно, лямбда-функция выдаст true и функции std::ranges::distance добавляется к счету 1, если равен, лямбда-функция выдаст выдаст false, байт отсекается,
функция std::ranges::distance ничего не добавит и не убавит.
Цикл происходит до тех пор, пока все символы строки не перебирутся. Дальше стандартная функция std::ranges::distance(letters), выдает общее количество итераций, т.е. сколько раз функция инструкция letter
выдала true.
*/