// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    float hats, heads;                                  // Объявление переменных типа float;
    cout.setf(ios_base::fixed, ios_base::floatfield);
    cout << "Введите дробное число: ";
    cin >> hats;
    cout << "Введи другое дробное число: ";
    cin >> heads;
    cout << "hats = " << hats << "; heads = " << heads << endl;
    cout << "hats + heads = " << hats + heads << endl;  // Ответ получится не совсем точным до каждой цифры, по причине - тип float обеспечивает точность до 6-7 значащих цифр от начала числа;
    cout << "hats - heads = " << hats - heads << endl;  // Ответ получится не совсем точным до каждой цифры, по причине - тип float обеспечивает точность до 6-7 значащих цифр от начала числа;
    cout << "hats * heads = " << hats * heads << endl;  // Ответ получится не совсем точным до каждой цифры, по причине - тип float обеспечивает точность до 6-7 значащих цифр от начала числа;
    cout << "hats / heads = " << hats / heads << endl;  // Ответ получится не совсем точным до каждой цифры, по причине - тип float обеспечивает точность до 6-7 значащих цифр от начала числа;
    return 0;
}
*/

/*
Для получения точного ответа лучше использовать тип double или long double.
*/


// Стандарт С++20:

#include <iostream>
#include <format>                                        // Подключение библиотеки форматирования текста;

int main()
{
    float hats{0.0f}, heads{0.0f};                       // Безопасная инициализация переменных типа float;
    std::cout << "Введите дробное число: ";
    std::cin >> hats;
    std::cout << "Введите другое дробное число: ";
    std::cin >> heads;
    std::cout << std::format("hats + heads = {:f}\n", hats + heads);  // Ответ получится не совсем точным до каждой цифры, по причине - тип float обеспечивает точность до 6-7 значащих цифр от начала числа;
    std::cout << std::format("hats - heads = {:f}\n", hats - heads);  // Ответ получится не совсем точным до каждой цифры, по причине - тип float обеспечивает точность до 6-7 значащих цифр от начала числа;
    std::cout << std::format("hats * heads = {:f}\n", hats * heads);  // Ответ получится не совсем точным до каждой цифры, по причине - тип float обеспечивает точность до 6-7 значащих цифр от начала числа;
    std::cout << std::format("hats / heads = {:f}\n", hats / heads);  // Ответ получится не совсем точным до каждой цифры, по причине - тип float обеспечивает точность до 6-7 значащих цифр от начала числа;
}


/*
Префикс std:: - указывает компилятору, что функция format берется из библиотеки format.
Заменяет вставку вывода <<, при этом безопасно форматирует строку, заключенную в скобках с применением
спецификаторов :f.
*/


// Стандарт С++23/С++26:
/*
//import std;
#include <iostream>
#include <print>                                         // Подключение современной библиотеки форматированной и сверхбыстрой печати текста (std::print/println);

int main()
{
    float hats{0.0f}, heads{0.0f};                       // Безопасная инициализация переменных типа float;
    std::print("Введите дробное число: ");
    std::cin >> hats;
    std::print("Введите другое дробное число: ");
    std::cin >> heads;
    std::println("hats + heads = {:f}", hats + heads);  // Ответ получится не совсем точным до каждой цифры, по причине - тип float обеспечивает точность до 6-7 значащих цифр от начала числа;
    std::println("hats - heads = {:f}", hats - heads);  // Ответ получится не совсем точным до каждой цифры, по причине - тип float обеспечивает точность до 6-7 значащих цифр от начала числа;
    std::println("hats * heads = {:f}", hats * heads);  // Ответ получится не совсем точным до каждой цифры, по причине - тип float обеспечивает точность до 6-7 значащих цифр от начала числа;
    std::println("hats / heads = {:f}", hats / heads);  // Ответ получится не совсем точным до каждой цифры, по причине - тип float обеспечивает точность до 6-7 значащих цифр от начала числа;
}
*/

