// Стандарт С++11:
/*
#include <iostream>

struct inflatable              // Объявление структуры (шаблона нового типа данных) inflatable;
{
char name[20];                 // Поле структуры: массив из 20 символов char;
float volume;                  // Поле структуры: переменная типа float;
double price;                  // Поле структуры: переменная типа double;
};

int main()
{
    using namespace std;
    inflatable guests[2] =     // Иинициализация массива guests типа структуры inflatable. Каждый элемент массива имеет одинаковые поля;
    {
        {"Bambi", 0.5, 21.09},
        {"Godzilla", 2000, 565.99}
    };
    cout << "Суммарный объем гостей " << guests[0].name << " и " << guests[1].name      // Объект cout получает доступ к полям name элементов массива guests под индексами 0 и 1 через оператор «точка» и с помощью оператора << выводит содержимое этого поля;
         << " равен " << guests[0].volume + guests[1].volume << " кубических фута.\n";  // Объект cout получает доступ к полям volume элементов массива guests под индексами 0 и 1 через оператор «точка», знчения этих полей суммируются и с помощью оператора << выводится сумма этих полей;
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>
#include <cstdint>
#include <format>
#include <string_view>                     // Подключение заголовочного файла для наложение взгляда на строку и определения ее размера;

constexpr uint8_t str_size{2};
constexpr uint8_t ar_size{20};

namespace                                  // namespace - пространство имен, которое сообщает компилятору, что данная структура будет использоваться только в файле main.cpp, тем самым защищая от конфликтов имен, в случае расширении программы;
{
    struct inflatable                      // Объявление структуры (шаблона нового типа данных) inflatable;
    {
        char name[ar_size]{};              // Поле структуры: инициализированный массив из 20 символов char;
        float volume{0.0f};                // Поле структуры: инициализированная переменная типа float, суффикс f делает значение типом float;
        double price{0.0};                 // Поле структуры: инициализированная переменная типа double;
    };
}

int main()
{
    inflatable guests[str_size] =         // Инициализация массива guests типа структуры inflatable. Каждый элемент массива имеет одинаковые поля;
  {
        {.name = "Bambi", .volume = 0.5f, .price = 21.09},
        {.name = "Godzilla", .volume = 2000.0f, .price = 565.99}
  };
    std::cout << std::format("Суммарный объем гостей {} и {} равен {} кубических фута.\n",     // Функция std::format принимает значения из полей name и volume элементов массива guests, формирует готовую строку, которую затем объект std::cout выводит на экран с помощью оператора <<;
    std::string_view(guests[0].name), std::string_view(guests[1].name), guests[0].volume + guests[1].volume);  // Функция format принимает значения из полей volume элементов массива guests под индексами 0 и 1 через оператор «точка», значения этих полей суммируются,
}                                                                                                              // далее формирует готовую строку, которую затем объект std::cout выводит на экран с помощью оператора <<;



// Стандарт С++23/С++26
/*
#include <print>
#include <string>                          // Подключение заголовочного файла для применения класса string
#include <cstdint>

constexpr uint8_t str_size{2};

namespace                                  // namespace - пространство имен, которое сообщает компилятору, что данная структура будет использоваться только в файле main.cpp, тем самым защищая от конфликтов имен, в случае расширении программы;
{
    struct inflatable                      // Объявление структуры (шаблона нового типа данных) inflatable;
    {
        std::string name{};                // Поле структуры: инициализированный объект строки;
        float volume{0.0f};                // Поле структуры: инициализированная переменная типа float, суффикс f делает значение типом float;
        double price{0.0};                 // Поле структуры: инициализированная переменная типа double;
    };
}

int main()
{
    inflatable guests[str_size] =         // Инициализация массива guests типа структуры inflatable. Каждый элемент массива имеет одинаковые поля;
  {
        {.name = "Bambi", .volume = 0.5f, .price = 21.09},
        {.name = "Godzilla", .volume = 2000.0f, .price = 565.99}
  };
    std::println("Суммарный объем гостей {} и {} равен {} кубических фута.",    // Функция println принимает значения из полей name и volume элементов массива guests и выводит на экран отформатированную строку;
    guests[0].name, guests[1].name, guests[0].volume + guests[1].volume);  // Через оператор «точка» берутся значения полей name и volume под индексами 0 и 1, значения суммируются, и итоговый результат передается в функцию println;
}
*/
