// Стандарт С++20:

#include <iostream>                                          // Директива препроцессора. Подключение заголовочного файла ввода-вывода;

static void string_1();                                      // Прототип функции 1, которая ничего не принимает и ничего не возвращает (void). Квалификатор static делает её видимой только для этого файла;
static void string_2();                                      // Прототип функции 2, которая ничего не принимает и ничего не возвращает (void);

int main()                                                   // Определение главной функции, которая возвращает целое значение;
{
    string_1();                                              // Первый вызов пользовательской функции string_1 для вывода сообщения;
    string_1();                                              // Второй вызов функции string_1 для повторения вывода сообщения;
    string_2();                                              // Первый вызов пользовательской функции string_2 для вывода сообщения;
    string_2();                                              // Второй вызов функции string_2 для повторения вывода сообщения;
}

static void string_1()                                       // Определение функции string_1;
{
    std::cout << "Вывод сообщения 1 функции.\n";             // Вывод пользовательского текста в поток консоли с помощью предопределенного объекта cout стандартной библиотеки std и оператора вставки <<;
}

static void string_2()                                       // Определение функции string_2;
{
    std::cout << "Вывод сообщения 2 функции.\n";             // Вывод пользовательского текста в поток консоли с помощью предопределенного объекта cout стандартной библиотеки std и оператора вставки <<;
}


// Стандарт С++23/С++26:
/*
//import std;                                                // Заменяет все старые #include. Включает в себя сразу все функции ввода-вывода и современной печати (пока экспериментально);
#include <iostream>                                          // Подключение классического заголовочного файла ввода-вывода (на случай использования std::cin);
#include <print>                                             // Подключение заголовочного файла современной форматированной печати (для работы функций std::print/println);

static void string_1();                                      // Прототип функции 1. Квалификатор static оставляет её видимой только в текущем файле;
static void string_2();                                      // Прототип функции 2. Квалификатор static оставляет её видимой только в текущем файле;

int main()                                                   // Определение главной функции;
{
    string_1();                                              // Двукратный последовательный вызов функции string_1;
    string_1();
    string_2();                                              // Двукратный последовательный вызов функции string_2;
    string_2();
}

static void string_1()                                       // Определение функции string_1;
{
    std::println("Вывод сообщения 1 функции");               // Функция println выводит форматированный текст в консоль и сама автоматически выполняет перевод строки в конце;
}

static void string_2()                                       // Определение функции string_2;
{
    std::println("Вывод сообщения 2 функции");               // Функция println выводит форматированный текст в консоль и сама автоматически выполняет перевод строки в конце;
}
*/
