// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    char ch = 'M';                                 // Объявление переменной типа char с последующей инициализацией;
    int i = ch;                                    // Объявление переменной типа int с последующей инициализацие. Код 77 символа М присвоится переменной i;
    cout << "ASCII код символа " << ch << " является " << i << endl;    // С помощью предопределнного объекта cout выведется на консоль символ М и его ASCII код 77;
    ch = ch + 1;                                   // Изменяем символ переменной, прибавляя 1. Станет символ N;
    i = ch;                                        // Код символа N присвоится переменной i;
    cout << "ASCII код символа " << ch << " является " << i << endl;    // С помощью предопределнного объекта cout выведется на консоль символ N и его ASCII код 78;
    cout << "Вывод символа ch с помощью cout.put(ch): ";
    cout.put(ch);                                  // Функция cout.put(ch) выведет на консоль символ N;
    cout.put('!');                                 // Функция cout.put(ch) выведет на консоль символ !;
    cout << endl << "Готово." << endl;
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>
#include <cstdint>                                     // Подключение типов данных с гарантированным фиксированным размером в битах;

int main()
{
    char ch{'M'};                                      // Объявление переменной типа char с последующей инициализацией;
    std::cout << "ASCII код символа " << ch << " является " << static_cast<std::int32_t>(ch) << "\n";    // С помощью предопределнного объекта cout выведется на консоль символ M и его ASCII код 77;
    ch += 1;                                           // Изменяем символ переменной, прибавляя 1. Станет символ N;
    std::cout << "ASCII код символа " << ch << " является " << static_cast<std::int32_t>(ch) << "\n";    // С помощью предопределнного объекта cout выведется на консоль символ N и его ASCII код 78;
    std::cout << "Вывод символа переменной ch: ";
    std::cout << ch;                                   // С помощью предопределнного объекта cout и вставки вывода << выведется на консоль символ N;
    std::cout << '!';                                  // С помощью предопределнного объекта cout и вставки вывода << выведется на консоль символ !;
    std::cout << "\nГотово.\n";
}


/*
static_cast<std::int32_t>(ch) - в операторе вывода текста на консоль, static_cast переопределяет переменную в целочисленную переменную типа int32_t,
на консоль выведится код символа согласно ASCII;
*/

// Стандарт С++23/С++26:
/*
//import std;
#include <print>
#include <cstdint>               // Подключение типов данных с гарантированным фиксированным размером в битах;

int main()
{
    char ch{'M'};                // Объявление переменной типа char с последующей инициализацией;
    std::println("ASCII код символа {} является {:d}.", ch, ch);    // С помощью функции println выведется на консоль символ M и его ASCII код 77;
    ch += 1;                     // Изменяем символ переменной, прибавляя 1. Станет символ N;
    std::println("ASCII код символа {} является {:d}.", ch, ch);    // С помощью функции println выведется на консоль символ N и его ASCII код 78;
    std::print("Вывод символа переменной ch: ");
    std::print("{}", ch);                                 // С помощью функции print выведется на консоль символ N;
    std::println("{}", '!');                                  // С помощью функции println выведется на консоль символ !;
    std::println("Готово.");
}
*/






