// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    const int ArSize = 20;
    char name[ArSize];                              // Объявление пустого массива из 20 элементов;
    char dessert[ArSize];                           // Объявление пустого массива из 20 элементов;
    cout << "Введите свое имя:\n";
    cin.get(name, ArSize).get();                    // Предопределнный объет cin применяет функцию get, которая записывает строку в массив;
    cout << "Введите свой любимый десерт:\n";
    cin.get(dessert, ArSize).get();                 // Предопределнный объет cin применяет функцию get, которая записывает строку в массив;
    cout << "У меня есть вкусный " << dessert;      // Оператор << считывает символы из массива dessert до первого '\0' и передает их в поток cout;
    cout << " для тебя, " << name << ".\n";         // Оператор << считывает символы из массива name до первого '\0' и передает их в поток cout;
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>
#include <cstdint>
#include <format>

constexpr int32_t ar_size{20};

int main()
{
    char name[ar_size];                      // Объявление пустого массива из 20 элементов;
    char dessert[ar_size];                   // Объявление пустого массива из 20 элементов;
    std::cout << "Введите свое имя:\n";
    std::cin.get(name, ar_size).get();     // Предопределнный объект cin применяет функция get(), которая записывает строку в массив;
    std::cout << "Введите свой любимый десерт:\n";
    std::cin.get(dessert, ar_size).get();  // Предопределнный объект cin применяет функция get(), которая записывает строку в массив;
    std::cout << std::format("У меня есть вкусный {}", dessert);// Оператор << передает в cout строку, которую сгенерировала функция std::format;
    std::cout << std::format(" для тебя, {}.\n", name);         // Оператор << передает в cout строку, которую сгенерировала функция std::format;
}


/*
  Предопределнный объет cin применяет функцию get, которая принимает 1 аргументом массив, куда запишется строка и 2 аргументом размер этого массива.
get принимает строку до символа \n, который так и остается в буфере ввода, после него автомтически ставится \0.
Функция .get() рабоатет с одним символом, в данном случаем \n, тем самым опустошая буфер вввода, подготавливая буфер для следующего ввода;
*/


// Стандарт С++23/С++26 (аналогично листинг 4.4):
// В строковом объекте функции get() нет по причине того, что этой функции нужно
// обязательно указывать размер массива. Динамический строковый объект сам принимает строку,
// автоматически управляет памятью и выделяет ровно столько байт, сколько необходимо.
// Для данной программы единственным верным решением остается глобальная функция std::getline(),
// так как именно она выступает посредником между объектом ввода std::cin и строковым объектом;
/*
#include <print>
#include <iostream>
#include <string>

int main()
{
    std::string name;                      // Объявление пустого динамического строкового объекта;
    std::string dessert;                   // Объявление пустого динамического строкового объекта;
    std::println("Введите свое имя:"); // Функция println автоматически выводит UTF-8 строку в поток вывода и автоматически переносит курсор на следующую строку;
    std::getline(std::cin,name);     // Функция getline считывает строку до символа новой строки \n, который потом отбрасывается, вместе с пробелами в строковый объект, при этом размер объекта становится равным под размер ввода;
    std::println("Введите свой любимый десерт:");     // Функция println автоматически выводит UTF-8 строку в поток вывода и автоматически переносит курсор на следующую строку;
    std::getline(std::cin,dessert);  // Функция getline считывает строку до символа новой строки \n, который потом отбрасывается, вместе с пробелами в строковый объект, при этом размер объекта становится равным под размер ввода;
    std::print("У меня есть вкусный {}", dessert);// Функция print берет строковый динамический объект и безопасно форматирует текст в UTF-8 в консоль;
    std::println(" для тебя, {}.", name);         // Функция print берет строковый динамический объект и безопасно форматирует текст в UTF-8 в консоль;
}
*/

/*
 В программе вместо массива, в котором жестко зафиксирован размер,
применен динамический строковый объект, который гарантирует, отсутствие переполнения памяти
и захвата памяти под другие данные. При этом код становится переносимым в другие ОС.
*/

