// Стандарт С++11:
/*
#include <iostream>
#include <climits>
#define ZERO 0                                      // Деректива препроцессора. Вместо константы ZERO в коде подставляется значение 0;

int main()
{
    using namespace std;
    short Semen = SHRT_MAX;                         // Знаковой переменной типа short присваивается максимальное значение константы (32 767);
    unsigned short Sonya = Semen;                   // Беззнаковой переменной типа short присваивается значение переменной Semen;
    cout << "У Семена на счету " << Semen << " долларов и у Сони на счету " << Sonya;
    cout << " долларов." << endl << "Теперь ";
    Semen = Semen + 1;                              // После прибавления 1 к значению 32 767, произойдет переполнение и обновленное значение -32 768 присвоится переменной Semen, т.к. переменная знаковая;
    Sonya = Sonya + 1;                              // После прибавления 1 к значению 32 767, результат будет 32 768, т.к. переменная Sonya имеет беззнаковый тип, т.е. еще не достигнута граница типа;
    cout << "у Семена " << Semen << " долларов на счету и у Сони " << Sonya;
    cout << " долларов на счету.\nНе повезло Семену." << endl;
    Semen = ZERO;                                   // Переменной присваивается 0. Вместо константы ZERO подставляется 0;
    Sonya = ZERO;                                   // Переменной присваивается 0. Вместо константы ZERO подставляется 0;
    cout << "У Семена на счету " << Semen << " долларов и у Сони на счету " << Sonya;
    cout << " долларов." << endl;
    cout << "Возьмем по 1 доллару с каждого счета." << endl << "Теперь ";
    Semen = Semen - 1;                              // При вычитании 1 от 0, результат равен -1, т.к. переменная знаковая;
    Sonya = Sonya - 1;                              // При вычитании 1 от 0, результат равен 65535, т.к. переменная беззнаковая;
    cout << "у Семена на счету " << Semen << " доллар и у Сони на счету " << Sonya;
    cout << " долларов." << endl << "Соне повезло!" << endl;
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>
#include <limits>                      // Современный заголовок пределов типов данных вместо старого сишного <climits>;
#include <cstdint>                     // Подключение типов данных с гарантированным фиксированным размером в битах;

constexpr int16_t ZERO = 0;            // Безопасное определние константы ZERO c приведением знакового типа int16_t, которой присваивается значение 0;
constexpr int16_t STEP = 1;            // Безопасное определние константы STEP c приведением знакового типа int16_t, которой присваивается значение 1;

int main()
{
    std::int16_t Semen{std::numeric_limits<std::int16_t>::max()}; // Инициализация переменной максимальным значением типа int16_t (32 767);
    std::uint16_t Sonya{static_cast<std::uint16_t>(Semen)};       // Безопасная инициализация переменной с явным приведением типа значением переменной Semen (32 767);
    std::cout << "У Семена на счету " << Semen << " долларов и у Сони на счету " << Sonya;
    std::cout << " долларов.\nТеперь ";
    Semen += STEP;                 // После прибавления 1 к значению 32 767, произойдет переполнение и обновленное значение -32 768 присвоится переменной Semen, т.к. переменная знаковая;
    Sonya += STEP;                 // После прибавления 1 к значению 32 767, результат будет 32 768, т.к. переменная Sonya имеет беззнаковый тип, т.е. еще не достигнута граница типа;
    std::cout << "у Семена " << Semen << " долларов на счету и у Сони " << Sonya;
    std::cout << " долларов на счету.\nНе повезло Семену.\n";
    Semen = ZERO;                  // Переменной присваивается 0. Вместо константы ZERO подставляется 0;
    Sonya = ZERO;                  // Переменной присваивается 0. Вместо константы ZERO подставляется 0;
    std::cout << "У Семена на счету " << Semen << " долларов и у Сони на счету " << Sonya;
    std::cout << " долларов.\n";
    std::cout << "Возьмем по 1 доллару с каждого счета.\nТеперь ";
    Semen -= STEP;                 // При вычитании 1 от 0, результат равен -1, т.к. переменная знаковая;
    Sonya -= STEP;                 // При вычитании 1 от 0, результат равен 65535, т.к. переменная беззнаковая;
    std::cout << "у Семена на счету " << Semen << " доллар и у Сони на счету " << Sonya;
    std::cout << " долларов.\nСоне повезло!\n";
}



// Стандарт С++23/С++26:
/*
//import std;
#include <print>
#include <limits>                      // Современный заголовок пределов типов данных вместо старого сишного <climits>;
#include <cstdint>                     // Подключение типов данных с гарантированным фиксированным размером в битах;

constexpr int16_t ZERO = 0;            // Безопасное определение константы ZERO c приведением знакового типа int16_t, которой присваивается значение 0;
constexpr int16_t STEP = 1;            // Безопасное определние константы STEP c приведением знакового типа int16_t, которой присваивается значение 1;

int main()
{
    std::int16_t Semen{std::numeric_limits<std::int16_t>::max()}; // Инициализация переменной максимальным значением типа int16_t (32 767);
    std::uint16_t Sonya{static_cast<std::uint16_t>(Semen)};       // Безопасная инициализация переменной с явным приведением типа значением переменной Semen (32 767);
    std::print("У Семена на счету {} долларов и у Сони на счету {} долларов."
                 "\nТеперь ", Semen, Sonya);
    Semen += STEP;                 // После прибавления 1 к значению 32 767, произойдет переполнение и обновленное значение -32 768 присвоится переменной Semen, т.к. переменная знаковая;
    Sonya += STEP;                 // После прибавления 1 к значению 32 767, результат будет 32 768, т.к. переменная Sonya имеет беззнаковый тип, т.е. еще не достигнута граница типа;
    std::println("у Семена {} долларов на счету и у Сони {} долларов на счету."
                 "\nНе повезло Семену.", Semen, Sonya);
    Semen = ZERO;                  // Переменной присваивается 0. Вместо константы ZERO подставляется 0;
    Sonya = ZERO;                  // Переменной присваивается 0. Вместо константы ZERO подставляется 0;
    std::println("У Семена на счету {} долларов и у Сони на счету {} долларов.", Semen, Sonya);
    std::print("Возьмем по 1 доллару с каждого счета.\nТеперь ");
    Semen -= STEP;                  // При вычитании 1 от 0, результат равен -1, т.к. переменная знаковая;
    Sonya -= STEP;                  // При вычитании 1 от 0, результат равен 65535, т.к. переменная беззнаковая;
    std::println("у Семена на счету {} доллар и у Сони на счету {} долларов."
              "\nСоне повезло!", Semen, Sonya);
}
*/

/*
constexpr int16_t ZERO = 0;                             // constexpr — константа, которая вычисляется на этапе компиляции, экономя ресурсы процессора.
Безопасная константа типа int16_t, вычисляемая на этапе компиляции (замена Сишному #define);

std::uint16_t Sonya{static_cast<std::uint16_t>(Semen)}; // static_cast — оператор C++ для безопасного и явного приведения одного типа данных к другому.
Объявление беззнаковой uint16_t переменной Sonya с явным, безопасным приведением знакового типа Semen;
*/

