// Стандарт С++11:
/*
#include <iostream>

struct inflatable                  // Объявление структуры (шаблона нового типа данных) inflatable;
{
    char name[20];                 // Поле структуры: массив из 20 символов char;
    float volume;                  // Поле структуры: переменная типа float;
    double price;                  // Поле структуры: переменная типа double;
};

int main()
{
    using namespace std;
    inflatable guest =             // Объявление и инициализация переменной guest типа структуры inflatable;
    {
        "Glorious Gloria",          // Строковый литерал копируется в массив char name[20];
        1.88,                      // Значение записывается в поле float volume;
        29.99,                     // Значение записывается в поле double price;
    };

    inflatable pal =               // Объявление и инициализация переменной pal типа структуры inflatable;
    {
        "Audacious Arthur",         // Строковый литерал копируется в массив char name[20];
        3.12,                      // Значение записывается в поле float volume;
        32.99                      // Значение записывается в поле double price;
    };

    cout << "Расширьте список гостей с помощью " << guest.name; // Объект cout через оператор точки получает доступ к полю name переменной guest и выводит его;
    cout << " и " << pal.name << "!\n";                        // Объект cout через оператор точки получает доступ к полю name переменной pal и выводит его;
    cout << "Вы можеьте получить то и другое за $";
    cout << guest.price + pal.price << "!\n";                  // Объект cout выводит сумму значений, полученных из полей price переменных guest и pal;
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>
#include <format>
#include <cstdint>

constexpr uint8_t ar_size{20};

namespace                              // namespace - пространство имен, которое сообщает компилятору, что структура используется только в файле main.cpp, тем самым защищая от конфликтов имен в случае расширения программы;
{
    struct inflatable                  // Объявление структуры (шаблона нового типа данных) inflatable;
    {
        char name[ar_size]{};          // Поле структуры: массив из 20 символов char;
        float volume{0.0f};            // Поле структуры: переменная типа float с инициализацией по умолчанию литералом типа float;
        double price{0.0};             // Поле структуры: переменная типа double;
    };
}

int main()
{
    inflatable guest                   // Объявление и инициализация переменной guest типа структуры inflatable;
    {
        "Glorious Gloria",             // Строковый литерал копируется в массив char name[20];
        1.88f,                         // Значение записывается в поле float volume c суффиксом f, означающий значение типа float;
        29.99,                         // Значение записывается в поле double price;
    };

    inflatable pal                     // Объявление и инициализация переменной pal типа структуры inflatable;
    {
        "Audacious Arthur",            // Строковый литерал копируется в массив char name[20];
        3.12f,                         // Значение записывается в поле float volume c суффиксом f, означающий значение типа float;
        32.99                          // Значение записывается в поле double price;
    };

    std::cout << std::format("Расширьте список гостей с помощью {} и {}!\n"  // Объект cout с помощью << получает доступ к строкам к полям name перменных guest и pal и выводит их.
                                "Вы можете получить то и другое за ${:.2f}!\n", // Также выводит сумму значений, полученных из полей price переменных guest и pal;
                             guest.name, pal.name, guest.price + pal.price);
}


// Стандарт С++23/С++26
/*
#include <print>
#include <string>

namespace                              // namespace - пространство имен, которое сообщает компилятору, что структура используется только в файле main.cpp, тем самым защищая от конфликтов имен в случае расширения программы;
{
    struct inflatable                  // Объявление структуры (шаблона нового типа данных) inflatable;
    {
        std::string name{};            // Поле структуры: объект;
        float volume{0.0f};            // Поле структуры: переменная типа float с инициализацией по умолчанию литералом типа float;
        double price{0.0};             // Поле структуры: переменная типа double;
    };
}

int main()
{
    inflatable guest                   // Объявление и инициализация переменной guest типа структуры inflatable;
    {
        "Glorious Gloria",          // Строковый литерал инициализирует поле строки name;
        1.88f,                         // Значение записывается в поле float volume c суффиксом f, означающий значение типа float;
        29.99,                         // Значение записывается в поле double price;
    };

    inflatable pal                     // Объявление и инициализация переменной pal типа структуры inflatable;
    {
        "Audacious Arthur",         // Строковый литерал инициализирует поле строки name;
        3.12f,                         // Значение записывается в поле float volume c суффиксом f, означающий значение типа float;
        32.99                          // Значение записывается в поле double price;
    };

    std::println("Расширьте список гостей с помощью {} и {}!\n"  // Функция println получает доступ к строкам к полям name перменных guest и pal, форматирует и выводит их.
                    "Вы можете получить то и другое за ${:.2f}!",   // Также выводит сумму значений, полученных из полей price переменных guest и pal;
                    guest.name, pal.name, guest.price + pal.price);
}
*/

