// Стандарт С++20:

#include <iostream>                                          // Директива препроцессора. Подключение заголовочного файла ввода-вывода;

static double convert(double);                               // Прототип функции, принимающей вещественное число и возвращающей вещественное число. Квалификатор static делает функцию видимой только для этого файла;

int main()                                                   // Определение главной функции, которая возвращает целое значение;
{
    double farlong, metr = 201.168;                          // Объявление вещественных переменных (выделение памяти под farlong без инициализации, инициализация metr значением 201.168);
    std::cout << "Введите расстояние в фарлонгах: ";         // Префикс std:: указывает на стандартную библиотеку. Оператор вставки << отправляет строку в поток вывода консоли;
    std::cin >> farlong;                                     // Префикс std:: указывает на стандартную библиотеку. Оператор извлечения >> забирает значение из консоли и записывает в переменную farlong;
    double yard = convert(farlong);                          // Объявление вещественной переменной yard и её одновременная инициализация результатом работы функции convert;
    std::cout << "В " << farlong << " фарлонге(ах), " << yard << " ярдов или "
    << farlong * metr << " метров.\n";                       // Сцепление (каскадирование) операторов << для последовательного вывода нескольких элементов в поток за один раз;
}

static double convert(double x)                              // Определение функции конвертации фарлонгов в ярды;
{
    return x * 220;                                          // Оператор return производит арифметическое вычисление и возвращает результат работы функции;
}


// Стандарт С++23/С++26:
/*
//import std;                                                // Заменяет все старые #include. import std включает в себя сразу все функции ввода-вывода и современной печати (пока экспериментально);
#include <iostream>                                          // Подключение классического заголовочного файла ввода-вывода (для работы std::cin);
#include <print>                                             // Подключение заголовочного файла современной форматированной печати (для работы std::print/println);

static double convert(double);                               // Прототип функции. Квалификатор static оставляет её видимой только в текущем файле;

int main()                                                   // Определение главной функции;
{
    double farlong, yard, metr{201.168};                     // Объявление вещественных переменных. Для переменной metr применена безопасная унифицированная инициализация фигурные скобки {};
    std::print("Введите расстояние в фарлонгах: ");          // Функция print выводит форматированный текст в поток консоли без автоматического перевода на новую строку;
    std::cin >> farlong;                                     // Ввод числового значения из консоли и запись в переменную farlong;
    yard = convert(farlong);                                 // Вызов функции convert и присвоение вычисленного значения переменной yard;
    std::println("В {} фарлонге(ах), {} ярдов или {} метров.",
        farlong, yard, farlong * metr);                      // Функция println выводит форматированный текст и сама автоматически переводит строку в конце. Переменные переданы через запятую для подстановки в {};
}

static double convert(double x)                              // Определение функции конвертации;
{
    return x * 220;                                          // Возврат вычисленного значения;
}
*/
