// Стандарт С++11:
/*
#include <iostream>
#include <string>                                       // Подключение заголовочного файла для использования класса string;

int main()
{
    using namespace std;
    string s1 = "pinguin";                              // Инициализация объекта строки строковым литералом;
    string s2, s3;                                      // Объявление двух пустых объектов строки;
    cout << "Можно присвоить строковый объект другому: s2 = s1\n";
    s2 = s1;                                            // Содержимое объекта строки s1 копируется (присваивается) в объект строки s2;
    cout << "s1: " << s1 << ", s2: " << s2 << endl;     // Предопределенный объект cout с помощью оператора << выводит содержимое объектов строки;
    cout << "Можно присвоить C-строку объекту типа string.\n";
    cout << "s2: \"buzzard\"\n";
    s2 = "buzzard";                                     // Строковый литерал (C-строка) присваивается объекту строки s2;
    cout << "s2: " << s2 << endl;                       // Предопределенный объект cout с помощью оператора << выводит содержимое объекта строки;
    cout << "Можно объединить строки: s3 = s1 + s2\n";
    s3 = s1 + s2;                                       // Объекту строки s3 присваивается результат объединения (конкатенации) двух объектов строк;
    cout << "s3: " << s3 << endl;                       // Предопределенный объект cout с помощью оператора << выводит содержимое объекта строки;
    cout << "Можно присоединить строку.\n";
    s1 += s2;                                           // К содержимому объекта строки s1 присоединяется содержимое объекта строки s2. s1 становится объединенной строкой;
    cout << "s1 += s2 дает s1 = " << s1 << endl;
    s2 += " за день";                                   // К содержимому объекта строки s2 присоединяется строковый литерал (с учетом пробелов внутри литерала);
    cout << "s2 += \"за день\" дает s2 = " << s2 << endl;
}
*/


// Стандарт С++20:

#include <iostream>
#include <string>                                               // Подключение заголовочного файла для применения класса string;
#include <format>

int main()
{
    std::string s1 = "pinguin";                                 // Инициализация объекта строки строковым литералом;
    std::string s2{}, s3{};                                     // Инициализация двух пустых объектов строки;
    std::cout << "Можно присвоить строковый объект другому: s2 = s1\n";
    s2 = s1;                                                    // Строка объекта строки s1 копируется (присваивается) объекту строки s2;
    std::cout << std::format("s1: {}, s2: {}\n", s1, s2); // Предопределенный объект cout с помощью оператора << выводит отформатированную строку;
    std::cout << "Можно присвоить C-строку объекту типа string.\n";
    std::cout << "s2: \"buzzard\"\n";
    s2 = "buzzard";                                             // Объекту строки s2 копируется (присваивается) строковый литерал (С-строка);
    std::cout << std::format("s2: {}\n", s2);        // Предопределенный объект строки cout c помощью оператора << выводит отформатированную строку;
    std::cout << "Можно объединить строки: s3 = s1 + s2\n";
    s3 = s1 + s2;                                               // Объекту строки s3 присваивается результат объединения (конкатенации) двух объектов строк;
    std::cout << std::format("s3: {}\n", s3);        // Предопределенный объект cout с помощью оператора << выводит отформатированную строку;
    std::cout << "Можно присоединить строку.\n";
    s1 += s2;                                           // К содержимому объекта строки s1 присоединяется содержимое объекта строки s2. s1 становится объединенной строкой;
    std::cout << std::format("s1 += s2 дает s1 = {}\n",s1); // Предопределенный объект cout с помощью оператора << выводит отформатированную строку;
    s2 += " за день";                                   // К содержимому объекта строки s2 присоединяется строковый литерал (с учетом пробелов внутри литерала);
    std::cout << std::format("s2 += \"за день\" дает s2 = {}\n", s2); // Предопределенный объект cout с помощью оператора << выводит отформатированную строку;
}


// Стандарт С++23/С++26:
/*
#include <string>
#include <print>

int main()
{
    std::string s1 = "pinguin";                                 // Инициализация объекта строки строковым литералом;
    std::string s2{}, s3{};                                     // Инициализация двух пустых объектов строки;
    std::println("Можно присвоить строковый объект другому: s2 = s1");
    s2 = s1;                                                    // Строка объекта строки s1 копируется (присваивается) объекту строки s2;
    std::println("s1: {}, s2: {}", s1, s2);      // Функция println выводит отформатированную строку;
    std::println("Можно присвоить C-строку объекту типа string.");
    std::println("s2: \"buzzard\"");
    s2 = "buzzard";                                             // Объекту строки s2 копируется (присваивается) строковый литерал (С-строка);
    std::println("s2: {}", s2);                      // Функция println выводит отформатированную строку;
    std::println("Можно объединить строки: s3 = s1 + s2");
    s3 = s1 + s2;                                               // Объекту строки s3 присваивается результат объединения (конкатенации) двух объектов строк;
    std::println("s3: {}", s3);                      // Функция println выводит отформатированную строку;
    std::println("Можно присоединить строку.");
    s1 += s2;                                                   // К содержимому объекта строки s1 присоединяется содержимое объекта строки s2. s1 становится объединенной строкой;
    std::println("s1 += s2 дает s1 = {}",s1);        // Функция println выводит отформатированную строку;
    s2 += " за день";                                           // К содержимому объекта строки s2 присоединяется строковый литерал (с учетом пробелов внутри литерала);
    std::println("s2 += \"за день\" дает s2 = {}", s2); // Функция println выводит отформатированную строку;
}
*/