// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    cout.setf(ios_base::fixed, ios_base::floatfield);               // Включает режим вывода чисел с плавающей точкой в фиксированном формате, вывод через экспоненту запрещен;
    cout << "Целочисленное деление: 9 / 5 = " << 9 / 5 << endl;               // Деление чисел типа int (по умолчанию). Дробная часть результата обрежется;
    cout << "Деление вещественных чисел: 9.0 / 5.0 = " << 9.0 / 5.0 << endl;  // Деление чисел типа double (по умолчанию). Дробная часть результата не обрежется, при этом ответ будет точнее в отличии от типа float;
    cout << "Смешанное деление: 9.0 / 5 = " << 9.0 / 5 << endl;               // Первый операнд является типом double (по умолчанию), второй операнд типом int (по умолчанию). Т.к. у одного из операндов есть плавающая точка, результат будет с плавающей точкой и типом double;
    cout << "Деление чисел типа double: 1e7 / 9.0 = ";
    cout  << 1e7 / 9.0 << endl;                                               // Результатом выражения будет число с плавающей точкой и иметь тип double;
    cout << "Деление чисел типа float: 1e7f / 9.0f = ";
    cout  << 1e7f / 9.0f << endl;                                             // Результатом выражения будет число с плавающей точкой и иметь тип float из-за примененного суффикса f;
    return 0;
}
*/

/*
cout.setf(ios_base::fixed, ios_base::floatfield); — Функция cout.setf включает режим вывода чисел с плавающей точкой в фиксированном формате, вывод через экспоненту запрещен.
ios_base::fixed — включение флага вывода значения только в дробном формате, после точки выведутся значения не в экспоненциальной форме.
ios_base::floatfield — сброс всех предыдущих флагов форматирования и установка последнего флага.
*/


// Стандарт С++20:

#include <iostream>
#include <format>                                                                    // Подключение библиотеки форматирования текста;

int main()
{
    std::cout << std::format("Целочисленное деление: 9 / 5 = {}\n", 9 / 5);     // Деление чисел типа int (по умолчанию). Дробная часть результата обрежется;
    std::cout << std::format("Деление вещественных чисел: 9.0 / 5.0 = {:f}\n", 9.0 / 5.0);   // Деление чисел типа double (по умолчанию). Дробная часть результата не обрежется, при этом ответ будет точнее в отличие от типа float;
    std::cout << std::format("Смешанное деление: 9.0 / 5 = {:f}\n", 9.0 / 5);                // Первый операнд является типом double (по умолчанию), второй операнд типом int (по умолчанию). Т.к. у одного из операндов есть плавающая точка, результат будет с плавающей точкой и типом double;
    std::cout << std::format("Деление чисел типа double: 1e7 / 9.0 = {:f}\n", 1e7 / 9.0);    // Результатом выражения будет число с плавающей точкой и иметь тип double;
    std::cout << std::format("Деление чисел типа float: 1e7f / 9.0f = {:f}\n", 1e7f / 9.0f); // Результатом выражения будет число с плавающей точкой и иметь тип float из-за примененного суффикса f;
}



// Стандарт С++23/С++26:
/*
//import std;
#include <print>

int main()
{
    std::println("Целочисленное деление: 9 / 5 = {}", 9 / 5);                  // Деление чисел типа int (по умолчанию). Дробная часть результата обрежется;
    std::println("Деление вещественных чисел: 9.0 / 5.0 = {:f}", 9.0 / 5.0);   // Деление чисел типа double (по умолчанию). Дробная часть результата не обрежется, при этом ответ будет точнее в отличие от типа float;
    std::println("Смешанное деление: 9.0 / 5 = {:f}", 9.0 / 5);                // Первый операнд является типом double (по умолчанию), второй операнд типом int (по умолчанию). Т.к. у одного из операндов есть плавающая точка, результат будет с плавающей точкой и типом double;
    std::println("Деление чисел типа double: 1e7 / 9.0 = {:f}", 1e7 / 9.0);    // Результатом выражения будет число с плавающей точкой и иметь тип double;
    std::println("Деление чисел типа float: 1e7f / 9.0f = {:f}", 1e7f / 9.0f); // Результатом выражения будет число с плавающей точкой и иметь тип float из-за примененного суффикса f;
}
*/
