// Стандарт С++11:
/*
#include <iostream>                              // Директива препроцессора. Подключение заголовочного файла ввода-вывода;

int main()                                       // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    using namespace std;                         // Открывает все имена из пространства std целиком, убирая необходимость писать префиксы;
    int symbol;                                  // Объявление  целочисленной переменной типа int;
    cout << "Сколько символов в слове?" << endl; // Вывод сообщения в поток консоли с помощью предопределнного объекта cout и оператора вставки <<. Перевод строки и принудительный сброс (очистка) буфера вывода на экран;
    cin >> symbol;                               // Ввод сообщения (значения) из потока консоли предопределнного объекта cin и оператора извлечения >> (извлечения в переменную);
    symbol = symbol + 4;                         // Изменение значения перменной, при помощи математической операции;
    cout << "В слове стало " << symbol << " символов" << endl; // Сцепление (каскадирование) операторов << для вывода нескольких элементов в поток за один раз;
    return 0;                                    // Функция возвращает 0, функция (программа) выполнена успешно;
}
*/


// Стандарт С++20:

#include <iostream>                              // Директива препроцессора. Подключение заголовочного файла ввода-вывода;

int main()                                       // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    int symbol;
    std::cout << "Сколько символов в слове? \n"; // Префикс std:: указывает компилятору, что предопределенный объект cout берется из стандартной библиотеки и оператор потока вывода (вставки) <<. \n - перевод на новую строку;
    std::cin >> symbol;                          // Префикс std:: указывает компилятору, что предопределенный объект cin берется из стандартной библиотеки и оператор потока ввода (извлечения) >>, при вводе значения, извлекается из консоли значение и присваивается переменной;
    symbol = symbol + 4;                         // Изменение значения перменной, при помощи математической операции;
    std::cout << "В слове стало " << symbol << " символов.\n"; // Сцепление (каскадирование) операторов << для вывода нескольких элементов в поток за один раз;
}


// Стандарт С++23/С++26:
/*
import std;                                                     // Заменяет #include <iostream>. import std включает в себя математические функции и функции ввода-вывода;;

int main()
{
    int symbol;
    std::println("Сколько символов в слове?");                  // std::println полностью заменяет каскады << и автоматически переносит строку;
    std::cin >> symbol;                                         // Префикс std:: указывает компилятору, что предопределенный объект cin берется из стандартной библиотеки и оператор потока ввода (извлечения) >>, при вводе значения, извлекается из консоли значение и присваивается переменной;
    symbol = symbol + 4;
    std::cout << "В слове стало " << symbol << " символов.\n";
}
*/


