// Стандарт С++11:
/*
#include <iostream>                                                 // Директива препроцессора. Подключение заголовочного файла ввода-вывода;

int main()                                                          // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    using namespace std;                                            // Открывает всю стандартную коробку C++ целиком;
    cout << "Первая программа на языке С++.";                       // Вывод сообщения в поток консоли с помощью предопределнного объекта cout и оператора вставки <<;
    cout << endl;                                                   // Перевод строки и принудительный сброс (очистка) буфера вывода на экран;
    cout << "Дальше предстоить глубокое изучение языка." << endl;   // Вывод сообщения в поток консоли с помощью предопределнного объекта cout и оператора вставки << и с последующим принудительным сбросом (очистке) буфера вывода на экран;

    return 0;                                                       // Функция возвращает 0, функция (программа) выполнена успешно;
}
*/


// Стандарт С++20:
#include <iostream>                                                 // Директива препроцессора. Подключение заголовочного файла ввода-вывода;

int main()                                                          // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    std::cout << "Первая программа на языке С++.\n";                // Префикс std:: указывает компилятору, что предопределнный объект cout берется из стандартной библиотеки и оператор потока вывода (вставки) <<. \n - перевод на новую строку;
    std::cout << "Дальше предстоить глубокое изучение языка.\n";    // Префикс std:: указывает компилятору, что предопределнный объект cout берется из стандартной библиотеки и оператор потока вывода (вставки) <<. \n - перевод на новую строку;
}                                                                   // Оператор возврата в стандарте С++20, так же в С++11 необязателен;


/*
// ==============================================================================
# ⚖️ РАЗНИЦА МЕЖДУ \n И std::endl (Важно для оптимизации)
// ==============================================================================

std::cout << "\n";      // Просто перенос строки. Текст копится в буфере памяти.
                        // Работает БЫСТРО. Используется в 99% случаев в C++20.

std::cout << std::endl; // Перенос строки + ПРИНУДИТЕЛЬНЫЙ сброс буфера на экран.
                        // Работает МЕДЛЕННО. Тормозит программу при больших объемах вывода.
                        // endl можно использовать для отладки, чтобы увидеть до какого места программа доходит.
 */


// Стандарт С++23 / С++26:
/*
import std;                                                         // Импорт стандартного модуля. Полностью заменяет старые заголовочные файлы (вроде <iostream>);

int main()                                                          // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    std::println("Первая программа на языке С++.");                 // Вызов функции стандартной библиотеки std::println. Она выводит строку в консоль и автоматически переносит курсор на новую строку;
    std::println("Дальше предстоит глубокое изучение языка.");      // Вызов функции стандартной библиотеки std::println. Она использует эффективное форматирование и безопасна для высоконагруженного кода;
}                                                                   // Оператор возврата return 0; опущен, так как он добавится автоматически;
*/