// Стандарт С++11:
/*
#include <iostream>                                                 // Директива препроцессора. Подключение заголовочного файла ввода-вывода;

int main()                                                          // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    using namespace std;
    cout << "Первая программа на языке С++.";                       // Вывод сообщения в поток консоли с помощью объекта cout и оператора <<;
    cout << endl;                                                   // Перевод строки и принудительный сброс (очистка) буфера вывода на экран;
    cout << "Дальше предстоить глубокое изучение языка." << endl;   // Вывод сообщения в поток консоли с помощью объекта cout и оператора << и с последующим принудительным сбросом (очистке) буфера вывода на экран;

    return 0;                                                       // Функция возвращает 0, функция (программа) выполнена успешно;
}
*/


// Стандарт С++20:
#include <iostream>                                                 // Директива препроцессора. Подключение заголовочного файла ввода-вывода;

int main()                                                          // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    std::cout << "Первая программа на языке С++.\n";                // Префикс std:: указывает компилятору, что объект cout берется из станартной библиотеки и оператор потока вывода <<. \n - перевод на новую строку;
    std::cout << "Дальше предстоить глубокое изучение языка.\n";    // Префикс std:: указывает компилятору, что объект cout берется из станартной библиотеки и оператор потока вывода <<. \n - перевод на новую строку;
}                                                                   // Оператор возврата в стандарте С++20, так же в С++11 необязателен;

