// Стандарт С++20:

#include <iostream>                                          // Директива препроцессора. Подключение заголовочного файла ввода-вывода;

static double Light_years_To_Astr_units(double);             // Прототип функции перевода световых лет в астрономические единицы, принимающей и возвращающей вещественное число double. Квалификатор static делает её видимой только в этом файле;

int main()                                                   // Определение главной функции, координирующей работу программы;
{
    double l_years;                                          // Объявление вещественной переменной double для хранения расстояния в световых годах;
    std::cout << "Введите расстояние в световых годах: ";    // Префикс std:: указывает на стандартную библиотеку. Оператор вставки << отправляет строку в поток вывода консоли;
    std::cin >> l_years;                                     // Префикс std:: указывает на стандартную библиотеку. Оператор извлечения >> забирает значение из консоли и записывает в переменную l_years;
    double as_units = Light_years_To_Astr_units(l_years);    // Объявление вещественной переменной as_units и её одновременная инициализация результатом работы пользовательской функции;
    std::cout << l_years << " световых лет = " << as_units
              << " астрономическим единицам.\n";             // Сцепление (каскадирование) операторов << для последовательного вывода нескольких элементов в поток за один раз;
}

static double Light_years_To_Astr_units(double light)        // Определение чистой функции преобразования расстояния;
{
    return light * 63240.0;                                  // Функция с помощью оператора return рассчитывает астрономическое значение по формуле С. Праты и возвращает его;
}

// Стандарт С++23/С++26:
/*
//import std;                                                // Заменяет все старые #include. import std включает в себя сразу все функции ввода-вывода и современной печати (пока экспериментально);
#include <iostream>                                          // Подключение классического заголовочного файла ввода-вывода (для работы std::cin);
#include <print>                                             // Подключение заголовочного файла современной форматированной печати (для работы функций std::print/println);

static double Light_years_To_Astr_units(double);             // Прототип функции. Квалификатор static оставляет её видимой только в текущем файле;

int main()                                                   // Определение главной функции;
{
    double l_years;                                          // Объявление вещественной переменной;
    std::print("Введите расстояние в световых годах: ");      // Функция print выводит форматированный текст в поток консоли без автоматического перевода строки;
    std::cin >> l_years;                                     // Ввод числового значения из консоли и запись в переменную l_years;
    double as_units = Light_years_To_Astr_units(l_years);    // Вызов функции Light_years_To_Astr_units и инициализация переменной as_units полученным значением;
    std::println("{} световых лет = {} астрономическим единицам.",
                 l_years, as_units);                         // Функция println выводит форматированный текст будущего и подставляет переменные l_years и as_units в фигурные скобки {};
}

static double Light_years_To_Astr_units(double light)        // Определение функции бизнес-логики;
{
    return light * 63240.0;                                  // Возврат вычисленного вещественного значения по формуле С. Праты;
}
*/
