// Стандарт С++11:
/*
#include <iostream>                                         // Директива препроцессора. Подключение заголовочного файла ввода-вывода;
#include <cmath>                                            // Директива препроцессора. Подключение заголовочного файла математических функций;

int main()                                                  // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    using namespace std;                                    // Открывает все имена из пространства std целиком, убирая необходимость писать префиксы;
    double area;                                            // Объявление переменной;
    cout << "Введите площадь комнаты в вашей квартире: ";   // Вывод сообщения в поток консоли с помощью предопределнного объекта cout и оператора вставки <<;
    cin >> area;                                            // Ввод сообщения (значения) из потока консоли предопределнного объекта cin и оператора извлечения >> (извлечения в переменную);
    double side;                                            // Объявление переменной;
    side = sqrt(area);                                      // Результат математической функции присваивается переменной side;
    cout << "Квадратный корень площади комнаты равен " << side << " квадратным метрам" << endl; // Сцепление (каскадирование) операторов << для вывода нескольких элементов в поток за один раз;
    cout << "Итог!" << endl;                                // Вывод сообщения в поток консоли с помощью предопределнного объекта cout и оператора вставки <<. Перевод строки и принудительный сброс (очистка) буфера вывода на экран;
    return 0;                                               // Функция возвращает 0, функция (программа) выполнена успешно;
}
*/


// Стандарт С++20:

#include <iostream>                                         // Директива препроцессора. Подключение заголовочного файла ввода-вывода;
#include <cmath>                                            // Директива препроцессора. Подключение заголовочного файла математических функций;

int main()                                                  // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    double area;                                            // Объявление переменной;
    std::cout << "Введите площадь комнаты в вашей квартире: "; // Префикс std:: указывает компилятору, что предопределенный объект cout берется из стандартной библиотеки и оператор потока вывода (вставки) <<;
    std::cin >> area;                                       // Префикс std:: указывает компилятору, что предопределенный объект cin берется из стандартной библиотеки и оператор потока ввода (извлечения) >>, при вводе значения, извлекается из консоли значение и присваивается переменной;
    double side = sqrt(area);                               // Объявление переменной, которой присваивается (инициализация) результат математической функции;
    std::cout << "Квадратный корень площади комнаты равен " << side << " квадратным метрам.\n"; // Сцепление (каскадирование) операторов << для вывода нескольких элементов в поток за один раз;
    std::cout << "Итог!";                                   // Префикс std:: указывает компилятору, что предопределенный объект cout берется из стандартной библиотеки и оператор потока вывода (вставки) <<;
}


// Стандарт С++23/С++26:
/*
import std;                                                  // Заменяет #include <iostream>. import std включает в себя математические функции и функции ввода-вывода;

int main()                                                   // Определение главной функции, которая ничего не принимает и возвращает целое значение;
{
    double area;
    std::print("Введите площадь комнаты в вашей квартире: ");// Без перевода на новую строку, пишется функция print;
    std::cin >> area;
    double side = std:: sqrt(area);
    std::println("Квадратный корень площади комнаты равен {} квадратным метрам.", side); // Для вставки згачения переменной используются фигурные скобки {};
    std::println("Итог!");
}
*/