// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    const int ArSize = 20;
    char name[ArSize];                      // Объявление пустого массива из 20 элементов;
    char dessert[ArSize];                   // Объявление пустого массива из 20 элементов;
    cout << "Введите ваше имя:\n";
    cin >> name;                            // Переопределенный объект cin с помощью оператора >> считывает строку с клавиатуры в массив name1 до первого пробела или переноса строки;
    cout << "Введите название своего любимого десерта:\n";
    cin >> dessert;                         // Переопределенный объект cin с помощью оператора >> считывает строку с клавиатуры в массив name1 до первого пробела или переноса строки;
    cout << "У меня есть вкусный " << dessert; // Оператор << считывает символы из массива dessert до первого '\0' и передает их в поток cout;
    cout << " для тебя, " << name << ".\n"; // Оператор << считывает символы из массива name до первого '\0' и передает их в поток cout;
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>
#include <format>
#include <cstdint>

constexpr int32_t ar_size{20};

int main()
{
    std::setlocale(LC_ALL, "");
    wchar_t name[ar_size];
    wchar_t dessert[ar_size];
    std::wcout << L"Введите ваше имя:\n";         // Если убрать объект для расширенной строки и префикс L, то на консоль выведется муссор;
    std::wcin >> name;                            // Переопределенный объект wcin с помощью оператора >> считывает широкую строку с клавиатуры в массив name;
    std::wcout << L"Введите название своего любимого десерта:\n";             // Если убрать объект для расширенной строки и префикс L, то на консоль выведется муссор;
    std::wcin >> dessert;                         // Переопределенный объект wcin с помощью оператора >> считывает широкую строку с клавиатуры в массив dessert;
    std::wcout << std::format(L"У меня есть вкусный {}", dessert); // Оператор << передает в wcout готовую широкую текстовую строку, которую сгенерировала функция std::format;
    std::wcout << std::format(L" для тебя, {}.\n", name);          // Оператор << передает в wcout готовую широкую текстовую строку, которую сгенерировала функция std::format;
}



// Стандарт С++23/С++26
/*
#include <iostream>
#include <print>
#include <string>                                               // Для динамических строк;

int main()
{
    std::string name;                                           // Создание пустого динамического строкового объекта класса std::string под имя;
    std::string dessert;                                        // Создание пустого динамического строкового объекта класса std::string под десерт;
    std::println("Введите ваше имя: ");                  // Функция println автоматически выводит UTF-8 строку в поток и переносит курсор на новую строку;
    std::cin >> name;                                           // Переопределенный объект cin с помощью оператора >> считывает UTF-8 строку с клавиатуры в объект name до первого пробела или переноса строки, автоматически выделяя нужный объем памяти;
    std::println("Введите название своего любимого десерта: "); // Функция println автоматически выводит UTF-8 строку в поток и переносит курсор на новую строку;
    std::cin >> dessert;                                        // Переопределенный объект cin с помощью оператора >> считывает UTF-8 строку с клавиатуры в объект dessert до первого пробела или переноса строки, автоматически выделяя нужный объем памяти;
    std::print("У меня есть вкусный {}", dessert);   // Функция print берет динамическую строку dessert, считывает ее байты строго до реальной длины слова и безопасно форматирует UTF-8 текст в консоль;
    std::println(" для тебя, {}.", name);            // Функция println берет динамическую строку name, считывает ее байты строго до реальной длины слова, форматирует UTF-8 текст в консоль и делает перенос строки;
}
*/

/*
  Суть этой маленькой программы показать, что если при первом вводе имени ввести 2 слова,
  то 2 ввод пропустится, по причине того, что объект cin считывает строку до первого пробельного символа,
  что означает конец строки и ставится \0 терминатор. Но в буфере ввода осталась еще одна строка,
  которая определяется в следующий массив.
*/