// Стандарт С++11:
/*
#include <iostream>

int main()
{
    using namespace std;
    float a = 2.34E+22f;                   // Чтобы предстваить число с экспонентой, нужно привести в математический вид, т.е. к 2,34 * 10 в 22 степени, это 23 400 000 000 000 000 000 000. Это значение присваивается переменной а;
    float b = a + 1.0f;                    // К 23 400 000 000 000 000 000 000 прибавляем 1,0, получаем 23 400 000 000 000 000 000 001. Результат присваивается перменной b.
    cout << "a = " << a << endl;           // Выведется на консоль значение 2.34E+22;
    cout << "b - a = " << b - a << endl;   // На консоль выведется резульат выражения b - a. Значение 23 400 000 000 000 000 000 001 компилятор представит 2.34Е+22 и получим выражение 2.34Е+22 - 2.34Е+22 = 0.
                                           // 0 получем по той причине, что float точное значение показывает до 6-7 значения после плавающей точки, остальное срезает, получаем 0. Единица которая стояла 23 по счету, срезалась;
    return 0;
}
*/


// Стандарт С++20:

#include <iostream>

int main()
{
    float a{2.34E+22f};                         // Чтобы предстваить число с экспонентой, нужно привести в математический вид, т.е. к 2,34 * 10 в 22 степени, это 23 400 000 000 000 000 000 000. Это значение присваивается переменной а;
    float b{static_cast<float>(a) + 1.0f};      // К 23 400 000 000 000 000 000 000 прибавляем 1,0, получаем 23 400 000 000 000 000 000 001. Результат присваивается перменной b.
    std::cout << "a = " << a << '\n';           // Выведется на консоль значение 2.34E+22;
    std::cout << "b - a = " << b - a << '\n';   // На консоль выведется резульат выражения b - a. Значение 23 400 000 000 000 000 000 001 компилятор представит 2.34Е+22 и получим выражение 2.34Е+22 - 2.34Е+22 = 0.
                                                // 0 получем по той причине, что float точное значение показывает до 6-7 значения после плавающей точки, остальное срезает, получаем 0. Единица которая стояла 23 по счету, срезалась;
}


// Стандарт С++23/С++26:
/*
//import std;
#include <print>                                 // Подключение современной библиотеки форматированной и сверхбыстрой печати текста (std::print/println);

int main()
{
    float a{2.34E+22f};                          // Чтобы представить число с экспонентой, нужно привести в математический вид, т.е. к 2.34 * 10 в 22 степени, это 23 400 000 000 000 000 000 000. Это значение присваивается переменной a;
    float b{static_cast<float>(a) + 1.0f};       // Явное сеньорское приведение типов static_cast<float> гарантирует, что сложение будет происходить строго в рамках одинарной точности float;
    std::println("a = {:f}", a);                 // Функция println число в экспоненциальной форме преобразует в десятичное число с плавающей точкой с высокой точностью;
    std::println("b - a = {:f}", b - a);         // На консоль выведется результат выражения b - a. Значение 23400001102275227418625.000000 - 23400001102275227418624.000000 = 0.000000;
                                                 // 0 получаем по той причине, что float точное значение показывает до 6-7 знаков, остальное срезает;
}
*/
